[{
	"id": "2600b2de-574f-4844-a148-7bc71ef31700",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/2600b2de-574f-4844-a148-7bc71ef31700",
	"created_at": "Sat Feb 06 00:34:32 UTC 2021",
	"company": "Xpanse",
	"company_url": "http:",
	"location": "Seattle",
	"title": "Senior Full-Stack Software Development Engineer",
	"description": "Currently it takes the same amount of time to process an average American mortgage as it does to walk nonstop from Manhattan to San Francisco. Talk about getting your steps in. This is the kind of technology – or lack thereof – that the mortgage industry is dealing with daily. Papercuts are a real concern. We have even heard rumors of fax machines and whiteout. Still no actual dinosaur sightings, but we are ever vigilant.pReady to roll up your sleeves and help us conquer the last frontier of fintech?  At Xpanse, we are working to disrupt an $11 trillion industry. Yep, you read that right - $11 trillion with a “t”. If the US mortgage industry was its own sovereign nation, it would be the third largest in the world by GDP.pSuffice to say, we are building to scale. What are we building?pOur SaaS platform will power the mortgage industry and its relationships with the tens of thousands of third-party providers that are integral to the mortgage process. Leveraging automation, real-time intelligence, big data, and analytics we are changing the way borrowers, lenders, servicers, and service providers take care of business.pBut disrupting an industry is a team sport, so we are looking for the best and brightest to join us. Our team is growing rapidly in the Greater Seattle Area and looking for cstrongSenior Full-Stack Software Development Engineersstrong to join our team.pcstrongWHAT YOU WILL BE DOINGstrongpculcliProviding technical leadership to help the team solve difficult technical problemslicliEstablishing and enforcing high standards in software engineering best practiceslicliHelping teammates become better software engineerslicliFormulating development plans and writing lots and lots of codeliulcstrongWHO YOU AREstrongpculcliYou have a team-first mentality, and value collaborative results over personal accoladeslicliYou have an owner’s instinct and sense of responsibilitylicliYou have an ability to execute challenging gameplans and deliver measurable resultslicliYou've demonstrated an ability to successfully engage productively with leaders and peersliulcstrongBASIC QUALIFICATIONSstrongpculcliAt least 5 years experience in the software industry as a developer delivering enterprise softwarelicliGood working knowledge of service-oriented architectures, cloud-based solutions (e.g. AWS), middle-tier frameworks (e.g. Spring, .Net framework), data streaming/computation microservices (e.g. Kafka, Flink), and relational and/or non-relational databases (e.g. PostgreSQL)licliFluent in Java or C#licliA bachelor's degree in Computer Science or related fieldliulcstrongPREFERRED QUALIFICATIONSstrongpculcliFintech, B2B/B2B2C technology, or start-up company experiencelicliFront-end development experience using modern frameworks like Node.js, React, etc.liulXpanse is an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.p",
	"how_to_apply": "Email your resume to ca href=\"mailto:recruiting@xpanse.com\"recruiting@xpanse.comap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3lZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2e025f44e66648e8820c3d36f0c42d5da5339176/logo-v-blue@2x.png"
}, {
	"id": "1a57c275-20e5-4d5f-8b10-c8c6354b35ca",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/1a57c275-20e5-4d5f-8b10-c8c6354b35ca",
	"created_at": "Fri Feb 05 18:05:36 UTC 2021",
	"company": "commonsku",
	"company_url": "http://www.commonsku.com",
	"location": "Toronto  /Remote",
	"title": "Full Stack Developer",
	"description": "Full Stack Developerpcommonsku is revolutionizing the way business is being done in the $25 Billion promotional marketing industry. commonsku is an established and rapidly growing SaaS application facilitating how swag is ordered and produced, handling the supply chain complexities of millions of branded products.  Over $900 Million goes through the platform from entrepreneurs all over the world who use commonsku to power their business.pThe opportunity:pWe develop an elegant and complex application that is transforming a multi-billion dollar industry, solving the problems of thousands by streamlining their businesses. From the development of new features to re-architecting our web app to scale, you will work on new functional components, integration with other software systems, as well as underlying architectural elements that enhance this experience. You will also have the flexibility to experiment with new technologies and contribute to the evolution of our master product, as well as contribute to special development projects related to our event business and the social community.pThe big picture:pAs a key member of a growing team developing an industry-leading SaaS application, you will work directly with the CTO and founders of the company.  We work in a highly collaborative, entrepreneurial environment; we are a small team where your opinion matters. You will have a wide range of responsibilities and will get exposure to all aspects of the platform.pThe environment:pOur culture is diverse, friendly, with a laid-back enthusiasm and sense of humour that makes collaboration easy. We’re passionate about our customers and their success, and we love fostering an environment that ignites creativity and celebrates the entrepreneur.  We work remote seamlessly with a distributed team across Canada and the US, while maintaining a base at HQ in Toronto.pSkills amp; RequirementspSkills:pCreative thinkerExcellent communication skillsTeam playerAbility to rapidly learn new technologiesProduce high-quality elegant designs rapidlyAble to juggle multiple prioritiespQualifications:pExperience in database driven web application design and developmentFull stack developerExperience with PHP, Python, JSExperience with Django or Laravel (similar MVC/MVT framework), Node, Express, ReactExperience with MySQLKnowledge of web protocols and standards (SSL, OAuth2, etc)Experience with software version control systems (GIT)pGood to have experience with:pReact NativeNoSQLcontainerization (Docker)AWSautomation (Chef/Puppet, Ansible, Cloudformation etc.)Serverless (API Gateway, Lambda)p",
	"how_to_apply": "ca href=\"https://secure.collage.co/jobs/commonsku/20104\"https://secure.collage.co/jobs/commonsku/20104ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa1dZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ba579a229949fad31fb506e0c2d81f972b74bb38/commonsku-logo.png"
}, {
	"id": "912fc53b-1b7f-427a-bc69-25f03b597f8c",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/912fc53b-1b7f-427a-bc69-25f03b597f8c",
	"created_at": "Fri Oct 30 15:33:27 UTC 2020",
	"company": "Defendify",
	"company_url": "https://www.defendify.io/",
	"location": "Portland, ME (Remote OK)",
	"title": "Senior Software Engineer (Full Stack)",
	"description": "Thanks for your interest in working with us! Defendify is a fast-growing, fun-loving cybersecurity startup with a small, vibrant team based in Portland, Maine. Resourcefulness, responsiveness, problem-solving, and simplicity are values that shape who we are, what we do, and how we deliver amazing customer experiences.pcstrongPosition DetailsstrongpWe're looking for a senior full stack software engineer to join us full-time, locally and/or in a remote capacity. This is a unique and exciting opportunity as we continue to expand the footprint of our groundbreaking, all-in-one cybersecurity platform. Every team member is a valuable contributor to our core SaaS product with day-to-day responsibilities covering a variety of development needs including building, maintaining, QA, and support for every aspect of the Defendify platform.pcstrongWe are looking for a team player who:strongpculcliHas a passion for solving problems and is eager to grow, learn, and tackle daily and long-term challenges and goals.licliWill dig in and ask questions from users to understand requirements; make a plan; dive into an existing codebase and learn where to make changes, or where to start new code.licliIs a good communicator who enjoys collaboration and thrives in a development culture that values clean code, automation and testability.licliMaintains excellent knowledge of how modern web applications work, including REST API usage, application security, cloud deployment and development best practices.licliIs comfortable self-directing their own work. No micro-management here!liulcstrongRequirements – Experiencestrongpculcli5+ years of Full-Stack Development experiencelicliHas been responsible for the entire lifecycle of code in at least one project, from scratch to QA to deployment to maintenance.licliHas experience implementing a RESTful API and an application which consumes it.licliIs familiar with the philosophy and implementation of development automation: tests, continuous integration, cloud deployment, and frequent production releases using an Agile/SCRUM process.licliSome DevOps experience is required.liulcstrongRequirements – TechnicalstrongpculcliExperienced in JavaScript including ES6, await/async, linting and front-end frameworks. We use libraries and frameworks as needed, but you need to be able to write and understand plain JS.licliExperience with Node and Browser based environments is required.licliUnderstands REST APIs and their role in application architectures. Has used and built APIs from the ground up.licliExperience with front end development: HTML, CSS, and familiarity with the ecosystem of related technologies (SASS, DOM). In addition, Vue (or similar framework) experience and knowledge of static site generators such as Jekyll/Hugo are helpful.licliUnderstand how to use Git(+Hub) and GitHub Flow.licliSome relational database experience is required. Pluses include: Experiences in relational and in-memory databases (MySQL, Postgres, Redis) as well as knowledge in generic SQL.licliSome experience with Amazon Web Services (AWS), Heroku, or similar services.liulcstrongYour SuccessstrongpYou are not alone in your role – Defendify's engineering team is made up of \"A\" players dedicated to your training and success. We thrive on an open-door policy and transparent management system that fosters team collaboration.pcstrongCompensation and BenefitsstrongpThis is a flexible position open to candidates with varying levels of experience and offers long term growth potential via a well-defined career path. Compensation is competitive and commensurate with experience, and is variable based on personal and team performance. Our benefits package is comprehensive and includes health, dental, and vision coverage, educational reimbursement, a 401(k) program, paid time-off and more.pcstrongLove What You DostrongpDefendify employees enjoy a modern work environment and culture where everyone genuinely cares about the work they do. We're passionate about our product, the problems we're solving, our customers, our partners, and our team. We're in it together, enjoying work and play every day from team lunches, impromptu social outings and celebrations, and charity missions. And yes, there is coffee, lots and lots of coffee!pcstrongOpportunity KnocksstrongpThis position offers a great opportunity to make an impact as a part of a small team solving big problems, making cybersecurity possible for Small Business. Are you a creative self-starter with an appetite to learn and grow? If so, we'd love to hear from you!p",
	"how_to_apply": "Apply now at ca href=\"https://defendify.breezy.hr/p/267bbae0c690-senior-full-stack-developer\"https://defendify.breezy.hr/p/267bbae0c690-senior-full-stack-developerap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBblNOIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a2730d55401adcd2e1832cebe43cc72f28ecbf83/Defendify_grey_R.png"
}, {
	"id": "eb3071be-4111-413d-bfe9-8b85e9e8737c",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/eb3071be-4111-413d-bfe9-8b85e9e8737c",
	"created_at": "Wed Feb 03 16:49:02 UTC 2021",
	"company": "Animoto",
	"company_url": "http:",
	"location": "Remote (USA only)",
	"title": "Senior Software Engineer, Full Stack",
	"description": "We are a remote-first, office-optional team. You are invited to do the best work of your life from anywhere within the USA.pAt Animoto, we have always believed video is the most powerful form of communication. The pandemic has made this more true than ever. Small businesses face unprecedented challenges in connecting with their audiences, as consumers are also challenged to connect with friends and family. Video can bring us together.pThat’s why our mission is to help anyone make a powerful, professional video. We make best-in-class, easy-to-use web and mobile video creation apps, with pre-built narrative templates and stunning video styles, that help our customers customize their own engaging videos to share on social media and beyond.pOver the next three years, we have a mission to make video creation faster, easier, and more fun, on any device, in ways that have never been done before.pWe are looking for a senior full stack engineer to join our product application teams. You will be working closely with the product, design mobile and other full-stack engineers to help propel our award-winning video creation service to the next level. You will be developing a responsive, elegant web experience and pioneering the next generation of video creation software.pWhat you’ll do:pculcliCollaborate with a team of engineers and product designers to develop new features while iterating and improving the existing experiencelicliBuild efficient and reusable React components and services using NodeJS and Ruby on RailslicliEnsure high standards in architecture discussions, code reviews, and provide technical leadershiplicliAdvocate for best practices, great usability, and exceptional qualityliulWhat we’re looking for:pculcli5+ years of professional experience building front-end web applicationslicliExpert knowledge of JavaScriptlicliExperience with modern JavaScript libraries and toolinglicliExperience with server-side web frameworkslicliClient-side performance and optimization experiencelicliStrong Computer Science fundamentalslicliExcellent communication and organization skillsliulWhat we offer:pculcliOpportunities for professional growthlicli100% covered health insurancelicliEquitylicliContribution to 401klicli$600 as part of our subscriptions perklicliRemote work setuplicliBi-weekly Product Demos, Social Thursdays, Focus FridayslicliBi-annual company events and hackathonsliulPlease note that we are not currently sponsoring visas.pWe embrace the differences of our team members and seek diversity of beliefs, backgrounds, education, and all the other things that make us unique. It is our inherent belief that diverse teams build better products. We aim to create a space where employees can bring their true selves to work every day. Animoto is proud to be an equal opportunity workplace and affirmative action employer. We welcome you to be a part of it.p",
	"how_to_apply": "ca href=\"https://jobs.lever.co/animoto/2afb604a-c7c5-4001-83ab-6d75b2176fbc?lever-origin=appliedamp;lever-source%5B%5D=GitHub\"https://jobs.lever.co/animoto/2afb604a-c7c5-4001-83ab-6d75b2176fbc?lever-origin=appliedamp;lever-source%5B%5D=GitHubap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ2VZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f628007bcf6b879633372a24424ea78c7241cccb/YoutubeLogo.png"
}, {
	"id": "bedc23bf-01bf-4840-9125-b016ae72633e",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/bedc23bf-01bf-4840-9125-b016ae72633e",
	"created_at": "Wed Feb 03 10:11:42 UTC 2021",
	"company": "URBANTZ",
	"company_url": "http:",
	"location": "Europe",
	"title": "Software Engineer ",
	"description": "Your talent and creative mind are needed at Urbantz !pJoin our team as a Software engineer (Intermediate – Senior level).pWhat? Javascript / React / MongoDB / KubernetespWhere? Remote from anywhere in Europe OR at our Brussels officepWhen? ASAPpAbout UspUrbantz operates on one of the most growing markets, offering a SaaS solution for retail, logistics, and e-commerce - businesses that tremendously accelerated in 2020.We’re growing fast for the last 5 years - recently Deloitte has listed as among the top 3 fastest growing startups in Belgium.We’re a team of diverse people who make things happen.Our culture is built on experimentation, constant development, flexibility, and encouragement of initiatives in an international, English speaking work environment.Company size: 50-60 people#TogetherWeDeliverpAbout the Teamp“Think, try, fail, collaborate and grow a better developer.”pAs a company, we believe that, sometimes, failing is the best way to learn and get better at what you do.We believe in the richness of collaboration and of diversity, for everyone to make an impact and work together toward a common goal.We offer a flexible and fun working environment with lots of autonomy and possibility to grow as a professional and as a person. You will find an engaged team, where people share their joy for technology, ready to coach you as well as learning from you.For us, the culture fit is important as we want to invest in our people for the long term.-Collaboration, Ownership, Innovation, Excellence amp; Sustainability are our core values-pTeam size: 15+pAbout the positionpYou will help build a modern, highly complex, multi-service application that leads to the delivery of millions of packages per year to clients like you.As a software engineer, you will work closely with our product manager to define the how to the why and what of our product.Our language: Javascript.Our main technologies: We use AngularJS and React-native on the front-end, and NodeJS for the backend. Our unit-tests use Jest, and our end-to-end tests use Protractor. We store data using MongoDB. Our code is stored in GitLab, and we make use of its CI/CD capabilities to deploy easily to AWS and Azure. Our containerization amp; orchestration uses Docker + Kubernetes.We work with short agile development cycles, with an alternance of 3 weeks on specific tasks and 1 week of cool down period to prepare for the next cycle.pAbout YoupYou are positive minded and like to find ways to constantly improve in what you do.pYou can get things done and communicate well while doing it;You are fluent in English;You have at least one relevant experience;You stay abreast of developments and best practices within the technologies we use.You already have affinity with logistic sector or interested to learn about it.What’s in it for you?pA fast growing company with lots of great challenges.A permanent contract with a great extra-legal package in Belgium, or a nice freelance long term collaboration anywhere in Europe.Flexible company, nice colleagues to work with, fun company activities (even for our remote people!),...If you desire to work to have an impact and bring a change: don’t hesitate and apply now!pInterview ProcesspBrief phone conversation with HRInterview with 2 team membersTechnical testInterview with CTO/Technical leads(A quick chat with CEO or COO)p#TogetherWeDeliverp",
	"how_to_apply": "email your resume to ca href=\"mailto:boris@urbantz.com\"boris@urbantz.comap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdG1YIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--aa2a2f1c2e77e6092ca2c56fd124dbba918c314e/Urbantz%20Logo.png"
}, {
	"id": "d1027fbb-580d-4a92-a52f-70224506d3ef",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/d1027fbb-580d-4a92-a52f-70224506d3ef",
	"created_at": "Wed Feb 03 09:02:49 UTC 2021",
	"company": "Kausa",
	"company_url": "https://www.kausa.ai",
	"location": "Berlin",
	"title": "Senior Full Stack Software Engineer (Frontend  Backend) in Typescript / Javascript",
	"description": "Our mission is to empower businesses to make data-driven decisions faster and more effortlessly than ever before. Therefore, we are building an advanced analytics platform using machine learning to reason why key performance indicators change.pJoin our venture as a software engineering allrounder both developing the frontend and backend of our platform and impact how people and businesses work. Get the chance to shape a young technology startup from its earliest days on through your efforts, experience, and industry expertise.pOur company is built at Merantix, a Venture Studio focussing on artificial intelligence. This means that we are part of an ecosystem of top-tier engineers, scientists, and entrepreneurs from leading universities who will help us along the way.pcstrongTasksstrongpAs the Frontend amp; Backend Software Engineer, you are one of our first employees and shape the company and its vision from the ground up. Among others, your main responsibilities are the following:pculcliDevelop state-of-the-art frontend and backend applications which will be used within organizations of all sizes;licliArchitect and implement multi-tenancy;licliBuilding highly-reliable software with the highest quality and security standards;licliCollaborate closely with our Chief Technology Officer and Chief Science Officer to bridge the gap between the analytical core of our product and its user interface;. Work with the Design and Product Team to implement an exceptional design and user experience;. As we value ownership and collaboration, you support and mentor your colleagues and review the team’s technical design, code, and documentation.liulcstrongRequirementsstrongpWe define ourselves by a culture of collaboration and ownership. We’re looking for a driven, capable, and thoughtful person to add to our vision. The main qualifications we expect you to have are the following:pculcliDegree in computer science, statistics, mathematics, physics, engineering, machine learning or relevant experience;It is essential that you are an experienced Software Engineer and built large scale applications in the past;Mastered Javascript and Typescript and are fluent in general-purpose languages such as Python or Java;Expert knowledge in technologies and frameworks such as Reactjs, D3js, NodeJS, GraphQL, or Cypress to name a few;Extensive know-how with Systems Design and Software Architecture.Pragmatic mindset, make quick decisions, and clearly prioritize on what moves the needle;Love what you do (and own it).liulcstrongBenefitsstrongpOur hierarchy is flat and communication direct, which means that we operate and learn fast, as a team. In addition to a competitive salary and equity package, you can expect the following:pculcliFlexible working hours as we believe in ownership and trust;licliLearning amp; Development Program for all our team members;licliRegular team events and intensive exchange with all Merantix companies;licliFree drinks, snacks, and breakfast.liulWe are an equal-opportunity employer and value diversity. We consider all applications equally regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, or gender identity. We strongly encourage individuals from groups traditionally underrepresented in tech to apply, and we can help with immigration.p",
	"how_to_apply": "ca href=\"https://kausa.join.com/jobs/1806782-senior-full-stack-software-engineer-frontend-and-backend-in-typescript-javascript-kausa?pid=357a3b4531918760973famp;utm_source=github_jobsamp;utm_medium=paidamp;utm_campaign=single%2Bpostingamp;utm_content=senior%2Bfull%2Bstack%2Bsoftware%2Bengineer%2Bfrontend%2Band%2Bbackend%2Bin%2Btypescript%2Bjavascript%2Bkausa\"https://kausa.join.com/jobs/1806782-senior-full-stack-software-engineer-frontend-and-backend-in-typescript-javascript-kausa?pid=357a3b4531918760973famp;utm_source=github_jobsamp;utm_medium=paidamp;utm_campaign=single%2Bpostingamp;utm_content=senior%2Bfull%2Bstack%2Bsoftware%2Bengineer%2Bfrontend%2Band%2Bbackend%2Bin%2Btypescript%2Bjavascript%2Bkausaap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEtYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--08e9bf3753a6f20098368dd8bbf841c49a46bdac/Bildschirmfoto%202021-02-03%20um%2010.01.12.png"
}, {
	"id": "a82fad21-3e65-4edc-945b-9be250ecc58a",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/a82fad21-3e65-4edc-945b-9be250ecc58a",
	"created_at": "Wed Feb 03 05:07:01 UTC 2021",
	"company": "DESYGNER",
	"company_url": "http://DESYGNER",
	"location": "Australia",
	"title": "Senior Full Stack Developer",
	"description": "Senior Full Stack developerpDo you wake up in the middle of the night and realise why a function isn’t working? Or perhaps you sleep soundly, dreaming of how you’re going to create a perfect user experience? Then we’d love to hear from you.pThe RolepAs a full-stack Developer at Desygner, you will be working directly with Desygner’s founders to organise, manage, and deliver technical solutions. You will play an active role in the development of our product and assist Desygner to reach its full potential in conjunction with our Product Led Growth. You will be responsible for:pMaintaining and enhancing the core editor code;Maintaining and improving multiple APIs, with thousands of queries by the minute;Low-level APIs integration with external services such as social networks, notification platforms, payment systems and more;Constant improvement in user experience;Assist us with internal practices to standardise development as we grow.pRequired Skills:pThe perfect candidate would have experience with MVC backend frameworks (PHP), Node tools (Gulp), CI, testing, JavaScript and CSS experience.pYou will ideally have:pMore than 4 years of software development experience;In-depth knowledge in PHP (MVC, ORMs, Cache, services), SQL and networks;In-depth knowledge in API server to client understanding;In-depth knowledge in low level (framework less) HTML, CSS, JS;Basic knowledge in node, ES6, transpilers, building tools;Independent (level B2 or equivalent) in English.pDesired Skills:pTemplate engines, SEO, SysOps, CI, Linux;AWS.pAbout UspDesygner is one of the leading tech companies now in Australia’s top 10 startups to work for (and top 500 in the world). Desygner is focused on building solutions that make design, branding, and marketing better through automation, AI, and adaptive technologies without needing a designer. There is no better opportunity to be part of something big than this and now is the chance to join our small team of under 50 in the Gold Coast before we explode!pWe believe that anyone should have a powerful brand and opportunities, regardless of their marketing budget. Our users’ success is our success and we’re on a mission to deliver solutions that make marketing better and easier for them.pB2C and B2B solutionsGlobal audience with over 13 million users (18,000+ new signups every day)Big corporate clients with many more industry leaders coming onboardLeading technology in graphic design, on-brand content creation, PDF editing, and intelligent design automationpOrganisation Cultural FitpWe are looking for professionals who seek constant improvement, and are willing to take responsibility and celebrate the wins.pPassion for true bootstrapped startups and big-picture developmentTakes ownership and finds solutions with our foundersAble to think outside of the box and solve problemspBenefits amp; PerkspWe nurture a creative, focused amp; fun environment where people look forward to coming to the office. Our team is diverse in both culture and talent which makes for a superbly unique work environment without politics and hierarchy.pWork in the Gold Coast with views over the beaches and canals from your deskMulticultural small, yet dynamic team with direction and leadership clearWork on solutions used by millions of people every dayCentral office location in Gold Coast near best restaurants, beaches, and public transport.Opportunity to live a holiday lifestyle overlooking the sun and sea every morningCompetitive compensation + equity option plans by seniorityFlexible hours, so you will not be controlled by the clock!Exciting career opportunities as an early team memberBe respected and heard in a startup that is now smashing numbersContinuous learning, development, and support from founders and external trainingp",
	"how_to_apply": "You must have rights for working full-time in Australia. Please email your resume and cover letter  to ca href=\"mailto:recruitment@desygner.com\"recruitment@desygner.comap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc21YIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3d925d75f33661a19c34b3a1fbe9ca50f4a15549/logo.png"
}, {
	"id": "a23fa201-23fd-4981-900d-32fdb8b81da0",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/a23fa201-23fd-4981-900d-32fdb8b81da0",
	"created_at": "Wed Feb 03 00:15:39 UTC 2021",
	"company": "Rainway, Inc.",
	"company_url": "https://rainway.com",
	"location": "Remote / Seattle",
	"title": "Senior API Developer",
	"description": "As a developer nothing feels better than coming across a beautifully designed API. Thoroughly documented, easy to understand resources, fast queries with predicable responses. A true delight to build against. We're looking to create an API developers can love as we help them build the future of computing. That is where you come in.pch1Introh1ch3Why this Role?h3colclicstrongBuild the next big thing:strong Rainway aims to bring desktop software to billions of new devices worldwide by creating new ways for developers to distribute and build their products. We are creating the world Xerox PARC imagined decades ago. You can help us realize this dream.liclicstrongWork with some of the best engineers in the world:strong A team of less than 5 from all over the world built technology that is used and trusted by some of the largest companies in the world. Learn from a team with decades of combined experience and share your own. We're stronger together.liclicstrongJoin us at a magical time:strong You not only get to design and build one of our core products, but also help define the culture of the company as a whole.liolch1About this Roleh1ch3So, what will you do as a Senior API Developer?h3culcliDesign and implement high performance scalable database-centric serverless microservices and RESTful APIslicliEstimate engineering effort, plan implementation, and roll out applications with cross-functional impactlicliOwn continuous improvement and fine tuning of API performance, scalability and securitylicliIndependently design, code, and test major features, as well as work jointly with other team members to deliver complex changesliulch3This might be for you if you have...h3culcliA strong API development background with an understanding of developing external facing APIs to be used by customers and their productslicli5+ years of backend experience: NodeJS, JSON, REST, JWT, Micro Services, MongoDB, NoSQLlicli4+ years of AWS LambdalicliProven ability to define and implement effective software development methodologieslicliExperience development of large-scale consumer facing micro-services solution is highly recommendedlicliExperience building serverless solutions is preferredlicliExcellent communication skills and the ability to clearly communicate technical concepts to a non-technical audiencelicliA flexible approach to analyzing technical issues and clearly communicating recommendations/solutionsliulch3FAQh3culcliWhat benefits can I expect?culcliTop of the line health, dental, and vision insurance.licliNew laptop/equipment of your choice.licliUnlimited PTO.licliParental leave.licli401KlicliA large spacious office with amenities to your heart's desire (although note that currently we are on a full time work from home policy).liullicliIs this role only full-time? Can I work remotely?culcliThis role is full-time. We have an office in Seattle, but currently all Seattle based employees work from home. This role is not limited to local candidates, fully remote candidates are welcome apply.liullicliDo you sponsor visas?culcliAt the moment, we're not able to sponsor or transfer visas for this role.liulliulch1How to Applyh1Sound like a good fit for you? Please send us an email to cstrongca href=\"mailto:work-at@rainway.com\"work-at@rainway.comastrong!pculcliInclude this role's title in your subject line (it'll help us to sort through the emails).licliSend along links that best showcase the relevant things you've built and done, e.g. your portfolio, LinkedIn, GitHub, code samples.licliYour curated Spotify playlist.licliKeep it real 🤘liul",
	"how_to_apply": "Sound like a good fit for you? Please send us an email to cstrongca href=\"mailto:work-at@rainway.com\"work-at@rainway.comastrong!pculcliInclude this role's title in your subject line (it'll help us to sort through the emails).licliSend along links that best showcase the relevant things you've built and done, e.g. your portfolio, LinkedIn, GitHub, code samples.licliYour curated Spotify playlist.licliKeep it real 🤘liul",
	"company_logo": null
}, {
	"id": "b3b63bca-e89a-4782-8557-c19ea24e4639",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/b3b63bca-e89a-4782-8557-c19ea24e4639",
	"created_at": "Tue Feb 02 08:22:55 UTC 2021",
	"company": "Kontist GmbH",
	"company_url": "https://kontist.com",
	"location": "Berlin",
	"title": "Senior JavaScript Developer (f/m/x)",
	"description": "cstrongTasksstrongpHave a high impact on our autonomous team. You will craft software that highly improves the lives of freelancers around banking and taxes. Build something you love, together with great and talented people who support you!pcstrongRequirementsstrongpculcli5+ years of backend experience (TypeScript, Node.js, SQL)licliKnowledge of at least one backend framework (does not have to be TypeScript)licliStrong frontend skills (React, React Native)licliAn eye for quality (Automated tests, clean code, striving for improvements)liulcstrongBenefitsstrongpculcliOpen to both full-time position as well as 100% remotelicliBright and spacious office in central BerlinlicliFlexible trust-based working hourslicliBring in your ideas (from Machine Learning to Deployment)licliFree flights to our nice office in Berlin, GermanylicliGreat team that loves to grow and learn from each otherliulPlease do not apply if you are not able to work during our core working hours (10:00 - 16:00 CEST). Occasional visits to Berlin (Germany) might be required.p",
	"how_to_apply": "ca href=\"https://kontist.join.com/jobs/1828840-senior-javascript-developer-f-m-x?pid=357a3b4531918760973famp;utm_source=github_jobsamp;utm_medium=paidamp;utm_campaign=single%2Bpostingamp;utm_content=senior%2Bjavascript%2Bdeveloper%2Bf%2Bm%2Bx\"https://kontist.join.com/jobs/1828840-senior-javascript-developer-f-m-x?pid=357a3b4531918760973famp;utm_source=github_jobsamp;utm_medium=paidamp;utm_campaign=single%2Bpostingamp;utm_content=senior%2Bjavascript%2Bdeveloper%2Bf%2Bm%2Bxap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcE9YIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5ae96fde0d4a3a6fcda0d7df77cbdd7e0b4399b5/kontist-squarelogo-1533721173355.png"
}, {
	"id": "f2eb2806-3a0d-41ff-bd42-20d27e845dae",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/f2eb2806-3a0d-41ff-bd42-20d27e845dae",
	"created_at": "Sat Jan 30 02:28:52 UTC 2021",
	"company": "iFit ",
	"company_url": "http:",
	"location": "Remote",
	"title": "Senior AWS Engineer (Remote) ",
	"description": "SUMMARYpLooking for an individual who is passionate about learning new things and solving problems. Must possess an extensive and deep understanding of AWS, and the ability to pick up and learn new AWS offerings often. Join us and help our organization practice DevOps methodologies!pJOB RESPONSIBILITIESpculcliHelp architect, design, and implement AWS services at all levels of the organizationplicliWork with and enable a large variety of teams and their AWS needsplicliCreate and manage infrastructure 100% through CloudFormation and codeplicliFocus on scaling our platformplicliOptimize network traffic through various AWS servicesplicliMonitor and tool stability/performance metricsplicliAnalyze DB performance and bottlenecksplicliShare on-call rotation dutiesplicliSupport innovation efforts and identify technology and solution roadmaps to improve mission capabilitiesplicliOrganizational AWS Areas of FocusplicliSecurityplicliRDSplicliIoTplicliLambda/API GatewayplicliContainerization (Docker, Beanstalk, ECS)plicliElementalplicliBusiness Intelligence (Redshift, QuickSight, Kinesis)plicliMachine Learning (SageMaker, ETL items)pliulDESIRED QUALIFICATIONS, EDUCATION and/or EXPERIENCEpculcliPassionate about learning new things and solving problemsplicli12 or more years of experience in software development and solution architectureplicliExtensive and deep understanding of AWS, and the ability to pick up and learn new AWS offerings oftenplicliA focus on performance, stability, and security in every taskplicliSuperior written and communication skills with ability to interface with various groups such as project team, and senior executivesplicliStrong capability and extensive experience in developing and writing technical solutionsplicliStrong organizational skills and the ability to independently execute work tasks in a rapidly changing, fast-paced environmentpliulBonus QualificationspculcliTypeScript and Node experienceplicliPostgres/MongoDB/Redis experiencepliulCOMPENSATION AND BENEFITSpculcliHighly competitive compensation, including a performance-based bonus.plicliFull benefits package (Medical, HSA, FSA, Dental, Vision and Life insurance)plicli401(k) with company match.plicliA PTO policy that ensures you are able to find a happy work-to-life balance.plicliAccess to cutting-edge technology and hardware for work and fitness.plicliCollaborative work space and environment.pliulABOUT IFITpiFit is group of talented designers, developers, marketers, and sales associates that are part of the larger, 2,500+ ICON Health amp; Fitness corporation, which also includes NordicTrack, Proform, Freemotion, and multiple other brands.  We have the flexibility and feel of a startup company with the security and benefits you would find in a broader corporate environment.  iFit is comprised of both on site and remote employees. We are headquartered in Logan, UT and you are welcome to work from the office or mostly anywhere else in the US (there are a few exceptions).  We are very experienced and comfortable working in a remote-friendly environment. We currently use Slack, Zoom, and Google to keep our communication alive and engaged!pCheck us out!pca href=\"https://stackoverflow.com/jobs/companies/ifit\"https://stackoverflow.com/jobs/companies/ifitapca href=\"https://www.ifit.com/aboutus\"https://www.ifit.com/aboutusap",
	"how_to_apply": "ca href=\"https://corehr.hrcloud.com/icon/#/job-detail/dea270e928dc1c0db633bf43e87d8bb4\"https://corehr.hrcloud.com/icon/#/job-detail/dea270e928dc1c0db633bf43e87d8bb4ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUdYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--18e69430840d3b0ac4bb0759a506430023132995/square-01.jpg"
}, {
	"id": "b9162195-dd7c-4a6d-be03-36e2f5dd2883",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/b9162195-dd7c-4a6d-be03-36e2f5dd2883",
	"created_at": "Fri Jan 29 15:21:24 UTC 2021",
	"company": "Strategic Financial Solutions",
	"company_url": "http:",
	"location": "Remote",
	"title": "Node.js Developer (United States)",
	"description": "OverviewpWould you enjoy helping our team to work smarter and not harder by infusing technology into our processes?  Do you like working in an environment where people genuinely like each other and look forward celebrating key wins and successes? Do you long for a high growth, decisive, fast-decision-making culture? If so, please read on!pStrategic Financial Solutions is a mid market financial services company that is diversifying through our new Interactive Products group.  You will have the opportunity to work in a small team building a cutting edge digital product focusing on financial wellness.  Join Strategic and help us build a business that will positively impact the financial journey of millions of Americans.pWe’re looking for a Node.js developer who takes pride in their code and loves proactively solving challenges. You’ll be building a new application entirely served out of a storage blob; but supporting dynamic personalization and access control via AWS AppSync and AWS Cognito along with integrating a new ML based recommendation. Working in a small team with one other React developer, a tech lead and a product manager, you will launch a new cutting-edge product in 2021.pResponsibilitiespTechnologies:On a day to day basis you will be coding in javascript and leveraging the following technologies:pGraphQLpAWS AppSyncpAWS DynamoDBpAWS Lambda FunctionspAWS ResolverspAWS Cognito PoolspAWS S3pTools we useWe use VS Code, Visual Studio, GitHub, and PostMan, Azure, AWS. For managing our work we use Jira Kanban boards along with Confluence for documentation and for CI/CD we leverage GitHub Actions. We also use Slack and Zoom for video conferencing.pQualifications:pNodeJspNoSQL (Dynamo, MongoDB)pExperiences with JSONpExperiences with cloud-based applicationspExperiences with CI / CDpNice to HavepExperience with front end framework like Gatsby, or ReactJspExperience with GitHub ActionspExperienced with AWS technologies (Lambda Functions, DynamoDB, S3 etc.)pExperienced with event-driven design, TDD (Test-Driven Design) or DDD (Domain-Driven Design)pGraphQLpMicroservicespYou:pPassion for learningpBachelor’s degree in Computer Science or equivalent experiencep1+ years of experience building apps with above technology stackspSelf-starter and self-motivatedpA great collaborator who enjoys helping other developerspAbout Strategic:pStrategic Financial Solutions is a leading consumer finance company that specializes in helping people that have too much credit card debt. We were recently named the 21st Best Company to Work for in New York by Best Companies to Work For and have been certified as a Great Place to Work 4 times.  Additional honors include being named, two times, as one of the 50 fastest growing companies in New York City and to the prestigious Inc. 500 list as one of the 500 fastest growing companies in the United States.pStrategic is committed to hiring, training, cultivating, promoting, and celebrating an environment where we have a welcoming and fulfilling place for all people to call home. Diversity of race, thought, sexual orientation, age, veteran status, religion, and disability will empower us to thrive as individuals, as teams, and as a company.p",
	"how_to_apply": "Email your resume to ca href=\"mailto:pharris@stratfs.com\"pharris@stratfs.comap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3FYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--91ba33e771e7686a99531d567b762e63114dff8c/sfs-logo-dark-1x.png"
}, {
	"id": "d5a837e4-d338-4f6b-ad98-c492c54a7021",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/d5a837e4-d338-4f6b-ad98-c492c54a7021",
	"created_at": "Thu Jan 28 16:50:15 UTC 2021",
	"company": "Neteffects",
	"company_url": "http://www.neteffects.com",
	"location": "St. Louis MO",
	"title": "Senior JavaScript Fullstack Developer ",
	"description": "You will be joining a platform focused on building software products and services that are critical to the Research and Development pipeline. These include core systems that track the genes and associated meta data that have the potential to be the next blockbuster biotech trait for insect and weed resistance, increased yield or improved quality.pYou may also be involved in building products that support the Agricultural biologicals business. You will have an opportunity to drive innovation in agriculture via software products that support cutting edge technologies including Next Gen Sequencing and Gene editing.pThis team specifically works on the following products: Sequence Utility Resource (SeqUR) is a sequence repository and data asset housing pipeline constructs, genes, proteins, and collaboration sequences allowing users to store, search, and analyze sequence data that helps fuel Crop Science Ramp;D pipeline.pOur products include real-time streaming analytics from an expanding collection of connected devices, mobile data collection, visualization suites, big data genomics repositories, and geospatial computing systems, just to name a few. To build great software, we need great people.pSkills Required (Bare Minimum): NodeJS, AWS Lambda, Cloudformation Templates, Vue, React, SQL, Postgres, strong communication skills, good teaming and collaboration skills, passion for learning.pJob Description:-Work as part of an agile development team to build and support applications.-Work with team and product manager to manage project priorities, deadlines, and deliverables.-Interact directly with business customers to gather and understand requirements and how they translate in application features.-Develop applications and services using the right tool for the job. -Conduct functional and non-functional testing.-Troubleshoot and debug applications.-Deploy applications across all environments in collaboration with development team, product management, and delivery.-Focus on code quality, including performing unit and integration testing.-Evaluate existing applications to refactor, update and add new features.-Develop any technical documentation needed to accurately represent application design and code.-Help to shape the vision for their own team's products, taking in to account impacts, dependencies, and opportunities to collaborate with other teams and groups.-Identify and pursue opportunities to improve own knowledge and skills.-Identify opportunities to develop new and better solutions.-Implement solutions to technical obstacles affecting own teampLearn amp; Grow:Ongoing focus on growth through training (domain and technical) and knowledge sharing through communities of agile teams.Innovation days, hack-a-thons, networking events, and volunteer opportunities.Diverse technology stacks in a forward thinking, open source-centric environment.pCollaborate:Work with other talented people solving a wide range of complex and unique challenges that have real world impact.Open workspace promotes collaboration and pairing in a fun, casual environment.We value your talent over a role or title. Strength of ideas valued over position on an org chart.pCulture:Work life balance and flexibility is not just discussed, it is our way of life.Challenging how things are done is not just encouraged, it is expected.We value autonomous, self-organizing teams allowing you to have a real say in what you work on, who you work with, and how you work.pOwnership:Interact directly with customers to create critical business solutions. Be responsible for architecting, implementing, testing, deploying, and supporting the software that drives Biotech Company Crop Science.Work with your team and product owner to manage project priorities, deadlines and deliverables.p",
	"how_to_apply": "Email your resume to ca href=\"mailto:sgrimshaw@neteffects.com\"sgrimshaw@neteffects.comap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUtYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7a18686a2034a2533cc659327eecb506fa696b46/netEffects-logo.png"
}, {
	"id": "ef8c071c-10bd-4ef0-8b4d-c530da2988ce",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/ef8c071c-10bd-4ef0-8b4d-c530da2988ce",
	"created_at": "Thu Jan 28 16:53:39 UTC 2021",
	"company": "Element 84, Inc.",
	"company_url": "https://vonq.io/3t7w8o0",
	"location": "Remote",
	"title": "AI Specialist / Machine Learning Engineer (m/w/d)",
	"description": "ch2Company Descriptionh2We're Element 84 and we're taking on some of the biggest challenges in software: petabyte search, consumer streaming, and Earth science repositories, just to name a few. We are a team of gamers, musicians, artists, pitmasters, pilots, and tinkerers and we think you might have fun helping us solve some big problems. Element 84 was founded by husband-and-wife engineers and has grown into a skilled group of developers, designers, project managers, and a business team that builds high performance systems for some of the biggest corporate and government clients in the world. Our main office is located in Alexandria, VA but we support a large remote workforce from Michigan to Texas and Pennsylvania to California.pch2Job Descriptionh2The Element 84 Cloud Based Metrics team develops data pipelines to supply geospatial data archive centers with relevant metrics collection dashboards to aid in their transition to the cloud. The Cloud Based Metrics team is an established and high performing agile team working in the Scaled Agile Framework methodology.pThis requirement is for a software engineer to assist in the development and maintenance of data pipelines for a Cloud Based Metrics System, facilitating data through the ingest process to dashboard visualizations, utilizing AWS services and the ELK stack (Elasticsearch, Logstash and Kibana).pPermission to work in the United States without sponsorship is required; All candidates must be able to pass a National Agency Clearance with Inquires (NACI) screening.pch2Required Skills:h2culcliAbility to effectively scope work from end user’s data reporting goals.licliAbility to administer Elasticsearch cluster including cluster/shard sizing, reindexing and debug common problems arising from running a self managed multi-tenant cluster.licliAbility to write data pipelines to parse logs using Logstash plugins.licliAbility to create graphs and dashboards in Kibana to meet end user reporting requirements and debug problems with data visualization.licliExperience with AWS services such as Cloudformation, EC2, Kinesis, Lambda, SQS, Cloudwatch and S3.licliExperience with NodeJS.liulch2Desired Skills:h2culcliFamiliarity with log formats from various AWS services such as S3 server access , Cloudfront distribution, Lambda execution, ELB, Container execution etc.licliExperience with Kibana Query Language, Lucene Query Language, and/or QuerydsllicliDesire to become an AWS Certified architect / engineer.licliBachelor's degree in a related field (preferred)liulch2Additional Informationh2Paying attention to who we are -- as a company, as people, as family members, friends, and colleagues, is probably the biggest part of who we are. There are lots of ways to run a company and you have probably experienced more than your share. For us, it's wanting to come to work, being around people we enjoy, taking on big things with people you trust, and sharing our achievements as a team.pculcliYou’ll get credit when things go right and we’ll have your back when things go wrong.licliWe only take on work that is challenging and right for us. There are projects we will turn down and the team has a say.licliWe may be a small company, but we have big company benefits meant to support the idea that we're here for the long term and that happiness comes from much more than just where you work, including 401k, health amp; dental insurance, life amp; disability insurance, flexible schedule, cell phone stipend, flexible spending accounts for transportation and dependent care and a generous PTO policy.liulWe have an extraordinary retention rate because we only hire extraordinary people. We hope that’s you.pElement 84 is an equal opportunity employer, with a company culture that values diversity. We embrace inclusivity and believe that diversity of thought, perspective, and experience helps us reach higher and think bigger. Element 84 is committed to hiring the best person for the team and does not discriminate on the basis of race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. If you are interested in joining us, we want to hear from you!pApply now by using the application form.pca href=\"https://vonq.io/3t7w8o0\"Click here for the application form!ap",
	"how_to_apply": "ca href=\"https://vonq.io/3t7w8o0\"Click here for the application form!ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaWVYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dc41ebefffff90e141446c4cb6f896d2f34a0fd2/element84.jpg"
}, {
	"id": "2f3bce46-908b-4018-9135-fe0e514d9929",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/2f3bce46-908b-4018-9135-fe0e514d9929",
	"created_at": "Wed Jan 27 17:11:53 UTC 2021",
	"company": "CircleBlack, Inc",
	"company_url": "http://www.circleblack.com",
	"location": "New Jersey ",
	"title": " Senior Software Developer (Full Stack)",
	"description": "Who are we?pCircleBlack, Inc. provides financial advisors with technology that aggregates data, integrates other financial applications seamlessly, manages data from multiple custodians and delivers actionable intelligence about client portfolios, helping advisors better manage clients' wealth while growing and deepening advisor-client relationships. CircleBlack provides a leading platform built for the digital age, with a web-based and mobile application that can be taken anywhere and accessed anytime. CircleBlack's solution leverages proprietary technology that helps sustain the Company's unique competitive advantages. CircleBlack believes in making wealth management better, for both the investor and the advisor. For more information about CircleBlack, visit ca href=\"https://www.circleblack.com\"https://www.circleblack.comapPosition Summary:pWe are looking for a passionate, forward thinker full stack senior software developer to design, develop and maintain our software solutions. You will be working on building quality performing software that enables financial advisors to deliver real time data to their clients while adapting to industry trends. Ideal candidates should be passionate about solving complex problems while being able to design, develop and support industry-leading solutions using NodeJS in a fast paced environment with seven years of application development.pResponsibilities:pDesign and develop NodeJS APIs, integrations, analytics engines, and infrastructure tools.Implement modern React user interfaces.Lead migration from one core application to another, while proposing and implementing modern performance optimizations and scaling strategies, such as React user interface.Drive software change while ensuring  software deliverables comply with quality standards.Collaborate effectively with stakeholders, designers and testers advising on impact, and performance to deliver the highest quality of software.Perform code reviews, suggesting improvements and ensuring adherence to best practices.Participate in an Agile development process.Developing for a full stack of technologies including NodeJS, Nginx, React, Angular 1, MySQL, ElasticSearch, Kibana, PHP, Perl, Python and/or Ruby, Redis on AWS Linux servers.Determine the root cause for complex software issues and develop practical solutions.Serve as technical team lead and act as a mentor to allow for skill development through coaching, and training opportunities.pCompetencies:pAbility to approach problems in a holistic manner, both tactical and strategicContinuously aware of leveraging coaching and mentoring opportunities with junior software engineersCreative, resourceful and outside- the- box thinking approachInitiator; natural “fixer” mentalityProblem-solver and analyticalpEducation/Qualification:p7+ years of application development experience; 4+ years experience using NodeJS. This is a must!2+ years of experience with MySQL database developmentExperience building maintainable and testable code bases, including API and Database design in an agile environment and driving software changeHands on experience integrating third-party SaaS providers using a variety of technologies including at least some the following: REST, SOAP, SAML, OAuth, OpenID, JWT, SalesforceExperience working in a cloud environment, specifically AWSExperience with non-relational databases such as Mongo, Redis, ElasticSearchAbility to work independently, and remotely for the time beingBSc degree in Computer Science, Engineering or relevant fieldpWhat we offer:pCompetitive base salary + equityFull benefits (medical, dental, vision, 401(k) match, commuter benefits, life insurance)Open vacation policyAdoption assistance, Employee assistance program, and shopping discountsCredit Union benefitsProfessional development, growth, and supportOpportunities for advancement as you learn and grow within the roleHybrid work schedulepCircleBlack, Inc is an Equal Opportunity Employer. All qualified applicants will receive considerations for employment, without regard to race, color, religion sex, national origin, disability, sexual orientation, gender identity, protected Veteran status, age , or any other characteristic protected by law.p",
	"how_to_apply": "ca href=\"https://circleblack.bamboohr.com/jobs/view.php?id=27\"https://circleblack.bamboohr.com/jobs/view.php?id=27ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjJXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--698d7d2d4397e9b50fa302dd39ebbe54abcf4554/R3mS4AvU3fwdkV9As8Ibs55L1MLNPOXzBj5E-338gbXPCf8rwaStOzkRNJQAFA2PAAWLwCy9JEkwMo-LHLG7oE1q_g56Z3DSvM6eYMCdjSvfpCoA6L4LWR2HGoHUODZvLskYKv_g.png"
}, {
	"id": "421871bb-05d3-4fbe-b00c-3f372fa35584",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/421871bb-05d3-4fbe-b00c-3f372fa35584",
	"created_at": "Tue Aug 04 17:23:12 UTC 2020",
	"company": "Sticker Mule",
	"company_url": "https://www.stickermule.com/careers",
	"location": "Anywhere",
	"title": "Javascript Engineer",
	"description": "cstrongAbout Sticker MulestrongpSticker Mule is the Internet's most \"kick ass\" brand. We are privately-owned, profitable, and powered by a  globally distributed team who cares deeply about delivering a great customer experience at the highest technical standards. Our software team operates from 17 countries, and we're always looking for more exceptional engineers.pThe Software team is responsible for building and maintaining our front-end and back-end services, developing new features and products, and troubleshooting problems.pcstrongca href=\"https://www.stickermule.com/about\"See more about our teams hereastrongpcstrongWe offerstrongpcolcliRemote work with flexible scheduleslicliVaried, interesting technical challenges to solvelicliA fun \"no bullshit\" work environmentliolcstrongWe like you to knowstrongpcolcliDockerlicliNextJSlicliReactlicliNodeJSlicliGraphQLlicliPostgreslicliRedislicliFamiliarity with RubylicliExcellent communication skills (English)licliDegree in Computer Science or equivalent practical experienceliolcstrongChallengesstrongpcolcliImprove and expand our React shared components gallerylicliMigrate a large Rails code base to JavaScript front-ends and back-endslicliMaintain optimal front-end performance on desktop and mobileliolcstrongCompensation and benefitsstrongpcolcli$99,000-$135,000+licli$10,000 signing bonuslicli4 weeks vacationliol",
	"how_to_apply": "cstrongApply here only:strong ca href=\"https://www.stickermule.com/career/7e6bb5ee-9953-4d46-b008-77a3bbc4ee29\"https://www.stickermule.com/career/7e6bb5ee-9953-4d46-b008-77a3bbc4ee29ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3VIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--04344d944b21465d33ecd7bd62098692640a8658/herman%206.jpg"
}, {
	"id": "987108f2-4859-4f16-922e-c9b681c606be",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/987108f2-4859-4f16-922e-c9b681c606be",
	"created_at": "Tue Jan 26 22:41:39 UTC 2021",
	"company": "Reaktor",
	"company_url": "https://www.reaktor.com",
	"location": "Amsterdam, Netherlands",
	"title": "DevOps Engineer",
	"description": "Love sharing your knowledge, and teaching devs how to deploy their code?Curious about working with different stacks in different domains?Passionate about life and have hobbies you just can’t shut up about?pSounds like you are a Reaktorian already 😎pAt Reaktor, we design and build tomorrow’s digital products. We are owned by our employees, known for an award-winning culture, and have a Node.js running satellite on low Earth orbit.pThe Amsterdam office has grown from a three-person corner room (and temporary camp) at WeWork to a fifty-person canal house on Looiersgracht (and a boat in the canal). And, we think our story in the Netherlands has only seen its pilot.pReaktor teams work in close co-operation with our clients. We deliver anything from automating beer brewing processes and scaling the streaming of popular TV shows (hint: winter is coming), to refining global scale ecommerce services to withstand 200k+ RPM traffic peaks during Black Friday sales.pYour job is to enable a worry-free development experience for your team. You make sure that automation and monitoring is in place, and that our clients understand the hows and whys of the infrastructure.pch3What we expect from youh3culcliYou hate repetitive work and agree that if it can be documented, it can be automated.licliYou want to work as a part of a development team.licliYou want to apply your knowledge to building scalable, observable systems.licliYou like to make application developers smile every time they use git push.liulch3What we offer, technically speakingh3culcliWe use the best tools for the job at hand. It can mean building a system on top of Kubernetes, or letting Heroku do the heavy lifting.licliWe automate things to the point where we can observe a platform auto-adjust itself during a sudden twentyfold traffic peak.licliOftentimes problems are best solved with no infrastructure or code at all, but with talking to the right people.licliOur juniors and seniors alike work on both the shiny and dirty bits of the infrastructure. No ivory tower architects here.licliWe have no hard language or tech requirements, but having experience with Linux and knowing at least one scripting language often comes in handy.liulch3Here’s what happens when you hit ‘Apply’h3💻Brief video chat, just to say hi. Hi!p👋🏽Introduction to Reaktor. We call this the Culture and Attitude interview. Here’s Adam to tell you more about what to expect from our interviews.p😎 Technical interview. No brain teasers or sorting algos, we promise! You choose a couple of topics to discuss, we choose a couple of topics to discuss.p📃 Closing interview. We clarify our mutual expectations of our common future. Naturally, necessities like compensation and equipment will be taken care of in a manner that satisfies us both.p❤️ You’re in!p",
	"how_to_apply": "Apply via ca href=\"https://www.reaktor.com/careers/devops-engineer/?utm_source=githubamp;utm_medium=job_boardamp;utm_campaign=2021\"our careers pageap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUdXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--13d2ec79bfa840dcd4932b829f14e53aa36f055d/logo.png"
}, {
	"id": "de895ae7-2947-4b31-a447-29d84c9c1ce1",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/de895ae7-2947-4b31-a447-29d84c9c1ce1",
	"created_at": "Tue Jan 26 22:39:05 UTC 2021",
	"company": "Reaktor",
	"company_url": "https://www.reaktor.com/",
	"location": "Amsterdam, Netherlands",
	"title": "Software Developer",
	"description": "Curious about applying your tech skills in different domains?Planning and theory are important, but the most value is in the execution?So passionate about your hobbies that your friends are asking you to shut up already?Keep finding yourself in heated discussions about the latest features in your favorite programming language?pLook at you sounding like a Reaktorian already 😎pAt Reaktor, we design and build tomorrow’s digital products. We are owned by our employees, known for an award-winning culture, and have a Node.js running satellite on low Earth orbit.pThe Amsterdam office has grown from a three-person corner room (and temporary camp) at WeWork to a fifty-person canal house on Looiersgracht (and a boat in the canal). And, we think our story in the Netherlands has only seen its pilot.pReaktor teams work in close co-operation with our clients. We deliver anything from automating beer brewing processes and scaling the streaming of popular TV shows (hint: winter is coming), to refining global scale ecommerce services and building 100kLOC JS codebases from scratch.pYour job is to solve really hard tech problems in meaningful, future-forward ways, in a small team of some of the sharpest minds around. If it runs code, our team of propeller-heads can make it.pch3What we expect from you:h3culcliCuriosity to apply your tech skills to different domains.licliGetting things done is what gives you energy. The best part of the day is when the code gets deployed to production. Even when it’s not perfect yet.licliYou see colleagues and clients as individuals with their respective strengths and weaknesses.liulch3What we offer, technically speaking:h3culcliWe use the best tools for the job at hand. Sometimes it’s Clojure running in a Kubernetes cluster, and sometimes it’s a small piece of JS running on AWS Lambda.licliSometimes tech is best solved with no code at all, but with talking to the right people.licliOur juniors and seniors alike work on both the shiny and dirty bits of the codebase. No ivory tower architects here.licliSome buzzwords we are into: functional programming, state management, Node.js, Clojure, TypeScript, React, Swift, Kotlin, SQL and NoSQL, Kanban.licliWe have no hard language or tech requirements, as we know that good developers can create great things in any language.liulch3Here’s what happens when you hit ‘Apply’:h3💻Brief video chat, just to say hi. Hi!p👋🏽Introduction to Reaktor. We call this the Culture and Attitude interview. Here’s Adam to tell you more about what to expect from our interviews.p😎 Technical interview. No brain teasers or sorting algos, we promise! You choose a couple of topics to discuss, we choose a couple of topics to discuss.p📃 Closing interview. We clarify our mutual expectations of our common future. Naturally, necessities like compensation and equipment will be taken care of in a manner that satisfies us both.p❤️ You’re in!p",
	"how_to_apply": "Apply via our ca href=\"https://www.reaktor.com/careers/software-developer-amsterdam/?utm_source=githubamp;utm_medium=job_boardamp;utm_campaign=2021\"careers pageap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdCtXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f333930f5f0325bbdfb0e8627dfdb2d6667e3d08/logo.png"
}, {
	"id": "95e1ae9c-289c-4f36-bd39-5b73a9bed202",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/95e1ae9c-289c-4f36-bd39-5b73a9bed202",
	"created_at": "Tue Jan 26 21:38:48 UTC 2021",
	"company": "Interledger Foundation",
	"company_url": "https://interledger.org/",
	"location": "Remote",
	"title": "Tech Lead",
	"description": "Tech LeadpAbout the Interledger FoundationInterledger is working towards a more equitable and creative global society through the open exchange of currency. To move this vision forward we will:Connect a powerful community of web advocates and leadersPromote creative and innovative solutions to connecting humanitySteward technology and standards work that advances open payment technologypAbout the RoleThe Interledger Foundation seeks an innovative and creative Tech Lead to join our welcoming and inclusive team.  This position will help drive the adoption of the Interledger Protocol position and contribute to the successful growth of the organization.pOur Ideal CandidateIs as excited about open source technology as we areThrives in a startup environment and is a self starterWants to be a member of a small and dynamic teampAs Tech Lead You WillBe an integral member of the Interledger Community of DevelopersCollaborate with the community and partners to determine and lead which technology based projects and standards work the Foundation will focus onDesign, implement, and test software across the Interledger Protocol stack, both frontend and backendDeliver presentations related to Interledger at meetings and conferencesHave an opportunity to build the department and IT team from the ground uppYour Experience5+ years of software development experience on large scale distributed systemsTrack record of building and maintaining performant micro service oriented software productsKnow the ins and outs of Node.js and are up for working in Java and TypescriptDemonstrated ability to proactively manage tasks and projects independentlypNice To HaveBS in Computer Science or similarHands-on experience with the Interledger Protocol stack and/or RustFamiliarity with the Interledger and/or payments ecosystempLocation: The Interledger Foundation is a fully remote organization, so this position can be based anywherep",
	"how_to_apply": "ca href=\"https://breezy.jobs/p/f987e5f2b793-tech-lead\"https://breezy.jobs/p/f987e5f2b793-tech-leadap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHlXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--529680aeb10d4a606d1729460b9a85dd653e389a/ilf-logo.png"
}, {
	"id": "cd91e908-4316-4315-91b9-3f3879932e0b",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/cd91e908-4316-4315-91b9-3f3879932e0b",
	"created_at": "Tue Jan 26 13:44:38 UTC 2021",
	"company": "EventMobi",
	"company_url": "http://eventmobi.com",
	"location": "Remote",
	"title": "Senior Frontend Engineer - Remote",
	"description": "cstrongEventMobi is a remote-first company and this is a remote job.strongpEventMobi is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment.  Accommodations are available upon request for candidates taking part in all aspects of the selection process.pcstrongWhy EventMobi?strongpEvents and conferences are being reimagined online, and EventMobi is building on ten years of event technology experience to innovate one of the most flexible and engaging virtual event platforms. We are an award-winning tech startup with teams in Toronto, Berlin and Manila, with thousands of customers around the globe.pWe believe that live events bring people together to enable change – both in business and our society at large. In the era of COVID-19, we have become a remote-first company and are hard at work helping thousands of events pivot to virtual. EventMobi has a huge impact on the success of our customers’ events and on their attendee experience. We are on a mission to revolutionize how event planners create, market and manage their virtual and in-person events, and how remote and on-site attendees experience conferences. We would love for you to join us and leave your mark.pcstrongAbout YoustrongpIf you're looking for a software development role that allows you to drive the web and the future of virtual events forward by utilizing the latest technologies, you've come to the right place! Developers at EventMobi focus on building powerful front-ends that work across devices, are offline capable and are just as, if not more powerful, than their native counterparts. We use the best tools for the job, including React+Redux, NodeJS, Cordova, and Webpack to develop a platform that generates amp; deploys thousands of apps annually and we're constantly looking to push the bar with your help!pcstrongWhat Your Work Will Focus OnstrongpculclicstrongModern Web Applicationstrong - You will be involved in enhancing our responsive web app that powers our mobile and virtual event space products. Solving interesting problems along the way - real time content updates, offline content, UI and architecture scaling for performance.liclicstrongOwnershipstrong - From initial design to deployment, test automation to performance monitoring, you own what you build end-to-end.liclicstrongArchitecture amp; Scalestrong - Gathering insights and employing strong design principles, you will determine the best tech to address our customers needs while optimizing for scale.liclicstrongDevelopmentstrong - Best practices, craftsmanship, well thought out code and mentorship to your team is your ideal and you preach this in your own work as well as with your teammates.liclicstrongQualitystrong - You will help grow the team around you in not only pushing new capabilities for our customers, but also maintaining the utmost quality in everything we build.liulcstrongWhat You Will Bring to the Teamstrongpculcli5+ years experience as a software developer working on large or fast scaling productslicli2+ years experience working with Javascript and a deep understanding in React/Redux including - concepts such as Hooks and functional componentslicliAbility to architect elegant solutions to complex problems using appropriate abstractions and techniqueslicliComfortable working with large code baseslicliExperience working with Restful APIslicliProficient using JSX/ES6/HTML/CSSlicliExperience with Material UI or Ant DesignlicliChampion best practices and performance improvementslicliExperience with automated testing suites like Jest, Enzyme and CypresslicliAbility to debug a codebase in a self-sufficient mannerlicliExcellent written and verbal communicationlicliKnowledge of SOLID Principles, Domain Modelling, and Design Patterns is a major benefitlicliAbility to mentor and grow team members, provide technical guidance and oversight on implementation directionliulcemNice to have:empculcliExperience with Python or other server-side languageslicliExperience with Docker and AWS and CI/CD like GitHub ActionslicliExperience with WebRTC, RTMP and video codecsliulcemSome of the interesting things you will get to work on:empculcliChanging the way our app loads (cache-first to network-first strategy)licliUtilizing Redux and dynamic reducerslicliReact based page builder that generates React components with API integrationlicliAdding more engagement features (chat/group discussions/1:1 video meetings/breakout rooms)liulcstrongRemote Workspace RequirementsstrongpculcliYou have a safe, comfortable, and ergonomic workspace and working environment - a private and quiet workspace is vital for doing your best work!licliYou have a reliable ethernet connection of at least 30Mbps upload speed with wired connection or reliable WiFi at home.liulcstrongWhat will you get from EventMobi?strongpculcliWe offer the experience of a life-time working with a dynamic, open-minded and diverse team, who are excited to come to work every day and passionate about what they do and the clients they helplicliCompetitive compensationlicliCompany Stock-OptionslicliA great culture with much more along the wayliulcstrongAbout EventMobistrongpWe're focused on building the most comprehensive amp; extensible event management platform to help planners create incredible event experiences online or in-person. We believe that events bring people together to enable change. This has never been more clear in the time of COVID-19. We've already changed how 20,000+ events in 70+ countries use technology at their events. Since the launch of our Virtual Platform, hundreds of organizations have taken their events online with EventMobi. We are seeing astonishing growth opportunities for virtual events and online conferences, and are looking forward to influencing hundreds of thousands of future events.pEventMobi is a remote-first company with a distributed global workforce. We do have local offices in Toronto, Manila and Berlin but everyone is equal and communicates the same way regardless if you work from home or from the office. We are improving our working culture to be more asynchronous, with better documentation, goal setting and collaborative technologies for remote work. Being accountable for our work, along with effective planning and communication to deliver results is a critical aspect of our success as a remote-first company. We offer flexible work hours in local time zones and encourage healthy work life balance.pIf you are interested in seeing EventMobi in action, check out some of the videos below:pculclica href=\"https://www.youtube.com/watch?v=tWW9jB85S3wamp;t=2s\"The Experience Manager Platformaliclica href=\"https://www.youtube.com/watch?v=hmJpVOe5dRE\"The EventMobi Mobile Event Appaliclica href=\"https://thenatureofevents.com/\"“The Nature of Events”a - a fun video showcasing the EventMobi TeamlicliTop brands and organizations from around the world have used EventMobi’s event app technology to create incredible event experiences - ca href=\"https://www.eventmobi.com/customers/\"hear directly from our customers.aliul",
	"how_to_apply": "Please visit ca href=\"https://eventmobi.bamboohr.com/jobs/view.php?id=75amp;source=github\"https://eventmobi.bamboohr.com/jobs/view.php?id=75amp;source=githuba and click \"Apply for This Job\"p",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdENXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--78d9681a7475e92db796ae3c406ce4f8d2640864/em-logo.jpg"
}, {
	"id": "a73ba2dc-6846-4d47-bce4-e898a4c6f8d3",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/a73ba2dc-6846-4d47-bce4-e898a4c6f8d3",
	"created_at": "Tue Jan 26 13:27:30 UTC 2021",
	"company": "CompuGroup Medical SE  Co. KGaA",
	"company_url": "https://www.cgm.com/",
	"location": "Koblenz",
	"title": "Softwareentwickler JavaScript / TypeScript / Angular E-Health Innovation (m/w/d)",
	"description": "ch2Als Softwareentwickler JavaScript / TypeScript / Angular E-Health Innovation (m/w/d) gestaltest Du heute schon mit, was die Zukunft bringt!)h2Präge als Frontend Experte (m/w/d) unsere Software mit Deiner Vision! Was Deine Leidenschaft für Webentwicklung mit unserer Leidenschaft für E-Health bewirken kann, kannst Du bei uns hautnah erleben. Wie unsere rasant anwachsende Nutzerbasis wachsen auch unsere Teams. Du suchst den Deep-Dive ins Gesundheitswesen? Und willst nebenbei mit deinem Code Prozesse verbessern, die einen maßgeblichen Beitrag zur Verbesserung des Gesundheitswesens leisten? Dann freuen wir uns auf Dich!pch2Dein Beitrag:h2culcliDu designst und implementierst in einem agilen Team (Scrum) neue Softwarekomponenten für eine komplexe Web-Anwendung auf Basis von TypeScript und AngularlicliDabei setzt du unter Verwendung modernster Web-Technologien, reaktiver Serverinfrastruktur und patentierter Kryptographie eigenständig User-Stories in Codes, Templates und Style Sheets umlicliÜber Unit Tests und defensive Programmiertechniken sicherst Du Deine Ergebnisse umfassend ablicliÜber Jira und Confluence trackst Du Deine Erfolge in der Optimierung der bestehenden Frontend ArchitekturlicliUnsere professionelle DevOps Infrastruktur stellt Dir dabei aktuelle Tools für effizientere Softwareentwicklung bereitliulch2Was uns wichtig ist:h2culcliAbgeschlossene Ausbildung, z. B. als Fachinformatiker (m/w/d) oder IT Studium, z. B. in Informatik, Wirtschaftsinformatik, Software Engineering, Computer Sciences, Physik oder Mathematik - alternativ gleichwertige BerufserfahrunglicliErfahrung in der Frontend Softwareentwicklung im Umfeld Web oder App mit JavaScript (oder TypeScript) sowie in einem relevanten Framework (z. B. Angular, AngularJS, Node.js, React.js)licliWir suchen unterschiedliche Erfahrungslevel - ob Berufseinsteiger (m/w/d), Fachkraft oder Senior, zeig uns was Du kannst, und wir finden das richtige Team für Dich!licliFließende Deutschkenntnisse (mind. B2) und gute Englischkenntnisseliulch2Was Du von uns erwarten kannst:h2culcliFreiraum für Deine Ideen innerhalb eines internationalen und hochspezialisierten Marktführer-UmfeldeslicliEine hohe, agile Lernkultur und engen Zusammenhalt im TeamlicliFlache Hierarchien und kurze Entscheidungswege innerhalb der AbteilungenlicliModerne Technologien innerhalb eines stabilen Tech-StackslicliFlexible Arbeitszeiten und Homeoffice Möglichkeiten (bis zu 3 Tage Homeoffice/Woche möglich)licliVielfältige Weiterentwicklungsmöglichkeiten und langfristige Perspektiven innerhalb des UnternehmenslicliAusgeprägtes Betriebliches Gesundheitsmanagement (Obstkörbe, Getränke, Untersuchungen) fördert Dein WohlbefindenlicliEin betriebseigenes Fitness-Studio zu kostenfreien Nutzung inkl. diverser KursangebotelicliZuschuss zur betrieblichen Altersvorsorge als Baustein einer sicheren ZukunftlicliZugang zu Rabatten und Sonderangeboten für MitarbeitendeliulBitte gib neben Deinen aussagekräftigen Bewerbungsunterlagen Deine Gehaltsvorstellungen mit an über das Bewerbungsformular!  Bei dieser Bewerbung kannst Du für verschiedene Fachbereiche infrage kommen, d.h. im nächsten Schritt leiten wir Deine Bewerbung an den passendsten Fachbereich weiter.pcstrongSynchronizing HealthcarestrongpcstrongWerden Sie jetzt ein Teil davon!strongpca href=\"https://vonq.io/3phkEvP\"Klicken Sie hier um zum Bewerbungsformular zu gelangen!ap",
	"how_to_apply": "ca href=\"https://vonq.io/3phkEvP\"Klicken Sie hier um zum Bewerbungsformular zu gelangen!ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--764e226d15844b40abe353ce5706e1accd704359/compu.jpeg"
}, {
	"id": "5a59ed8b-69bc-4919-8ad9-9cec588fb0fd",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/5a59ed8b-69bc-4919-8ad9-9cec588fb0fd",
	"created_at": "Tue Jan 26 13:10:42 UTC 2021",
	"company": "Startupz",
	"company_url": "http://www.startupz.com",
	"location": "remotely",
	"title": "Full Stack Developer (Ruby + React stack)",
	"description": "cstrongIntrostrongpStartupz is hiring a Full Stack Developer to help us build and maintain the apps at our different startups. If you like a dynamic work situation and working on the cutting edge in your code, this is the job for you!pWe are accepting applications for the next two months and we fill the open position as soon as we’ve found the right candidate.pcstrongAbout the PositionstrongpcemFull Stack DeveloperempYou’ll be joining our team in building our apps and pushing the bar by building new features.pWe typically use a Ruby(-on-Rails), React stack that we host on AWS. We like well-structured light-weight code that’s easy to understand and to work with.pWe have a clearly defined product development process and work from detailed interaction designs.pDuring the daily standups we share our progress and discuss next tasks. It’s also a great moment for sharing knowledge and challenges.pYou have a lot of autonomy with regards to deciding what the best solution is for the tasks you work on.pcstrongAbout StartupzstrongpStartupz is a startup studio that develops and launches new companies. We develop innovative products, systems and services, \u2028 and then build teams to scale them into companies.pSome of the things we do: we work to eliminate language barriers at Tolq.com, protect your privacy at LegalSite.co and make the internet safer at Codekeeper.co.pCheck out our projects to get an idea of what we like to work on (please note: pre-launch projects are not on our website yet).pWe are remote-first and have a central office in The Hague.pWe have a ‘startup-like’ mentality and work inside a larger group of hi-tech web companies.pcemWhat else can you expect from us?empculcliEnthusiastic and fun colleagueslicliStartup mentality and possibilitieslicliFriday afternoon drinks and/or (theme)parties (when COVID allows)liulYou can expect a mindful onboarding process with ramp-up and time to learn. You can expect a team that listens, and to be heard. You can expect to give and provide direct feedback. You can expect to be counted on. You can expect to do your best work and build a career here.pWe build our apps, our teams, and our company for the long haul, with a strong eye to other teams’ effectiveness amp; happiness, from design to support and operations. A healthy, resilient app starts with a healthy, resilient organization.pcstrongAbout YoustrongpWe are looking for someone who is ready for this challenge with a getting things done work spirit.pcemSkillsempculcliYou have experience working with Ruby-on-RailslicliYou have a good sense of ReactlicliYou are crazy about building beautiful and intuitive interfaces and solid scalable backendlicliYou are driven and enthusiasticlicliYour communication skills in English are proficientlicliYou are comfortable to adapt and multitask in a fast-paced environmentliulcemExperienceempculcliExperience with Ruby, Python or Node.jsliulcstrongHow to ApplystrongpYou can apply via ca href=\"https://startupzcom.recruitee.com/o/full-stack-developer-ruby-react-stack\"https://startupzcom.recruitee.com/o/full-stack-developer-ruby-react-stackapPlease send an application that speaks directly to how you would like to fill this position. There are no right answers or expectations. Show us your role in Startupz’s future and our role in yours. Address some of the work we do. Introduce yourself as a colleague. Feel free to respond in either Dutch or English.p",
	"how_to_apply": "ca href=\"https://startupzcom.recruitee.com/o/full-stack-developer-ruby-react-stack\"https://startupzcom.recruitee.com/o/full-stack-developer-ruby-react-stackap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3FXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bada9463a08007570c432e2f83208165926664fb/thumb_photo_1559576151.png"
}, {
	"id": "51a1518e-d701-40bc-9496-146f56fa70a5",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/51a1518e-d701-40bc-9496-146f56fa70a5",
	"created_at": "Tue Jan 26 11:15:26 UTC 2021",
	"company": "Ignitia AB",
	"company_url": "https://www.ignitia.se",
	"location": "Sweden",
	"title": "Full Stack Developer ",
	"description": "Full Stack DeveloperpLooking for exciting challenges in a high-growth, high-impact market? Ignitia has a small team of dedicated scientists, developers and meteorologists that now wish to expand with a full-time remote (GMT-1h to GMT+2h) full stack developer whose main focus will be to build and maintain front-end products amp; features as well as back-end solutions powering the products and services.pThe companyIgnitia is an entrepreneur led business that offers critical decision support in West Africa. Based on several years of development and market traction, our science-based innovation is designed for the agriculture sector. We have developed a weather forecasting model for the tropics that is twice as accurate as existing models, allowing us to provide critical weather data and forecasts to farmers and agribusinesses through various channels such as mobile phones and web dashboards. Using our forecasts, small-scale farmers have the ability to double yields and incomes, reducing food insecurity and poverty for some of the poorest in the world.pTo date we have reached over 1,500,000 farmers with our daily weather forecasts. Due to our pioneering position and proven track record we now offer the right person the opportunity to grow with the company.pThe positionIgnitia AB has a vacancy for a full-time full stack developer (estimated 50-50% balance between front-end and back-end work, varying over time) to work within the technical team while interfacing with the mobile marketing manager and other business units.pMain duties will include:p●\tDesign, develop and maintain our front-end product portfolio and their associated back-ends including interfaces to various APIs.●\tIdentify opportunities to improve the existing products and create efficient and robust workflows in order to enhance both internal operations as well as end-user experience.●\tMaintain and build various web interfaces (back-end as well as front-end)●\tTrack and analyze end-user product/feature usage in order to identify downstream/future development opportunitiespQualificationspIn addition to having a university degree (at BSc or MSc level), we expect you to have the following experience and skills:p●\t3+ years of working experience in software development●\tIn-depth understanding of the entire development process (design, development, deployment, operations and maintenance)●\tEngineering mindset and great problem-solving abilities●\tComfortable with the Unix environment●\tBack-end and front-end development skills●\tSolid understanding of the following technologies: HTML, CSS, JavaScript (including Vue.js), PHP (including Laravel), relational databases (including PostgreSQL), REST APIspBeneficial skills include:p●\tMobile app development experience●\tKnowledge of GIS-related libraries/frameworks (Leaflet, PostGIS)●\tStrong product sense and the ability to own large areas of product design and usability (UI/UX)●\tKnowledge of other JavaScipt frameworks (React, Node.js) and Python (Flask, Django)●\tFamiliar with unit testing, TDD, design patterns and modern programming practicespIn addition, you should:p●\tWork efficiently, valuing autonomy and getting things done, but also as part of a team●\tMaintain focus under rapidly changing work tasks and under time pressure●\tBe willing to learn and master new technologies and concepts●\tHave a positive attitude●\tHave good written and communication skills in EnglishpRemuneration amp; terms of employmentSalary commensurate with skills, expertise and experience. Other employment terms and conditions will be agreed during contracting phase.pApplicationPlease email your CV and a cover letter to info at ignitia.se with the subject “Full Stack Developer”. Last date for applying is February 12, 2021.pContact for questions:Daniel Salvador, Head of Systems Development, ca href=\"mailto:daniel.salvador@ignitia.se\"daniel.salvador@ignitia.seaAndreas Vallgren, Chief Science Officer, ca href=\"mailto:andreas.vallgren@ignitia.se\"andreas.vallgren@ignitia.seap",
	"how_to_apply": "ca href=\"https://apply.workable.com/ignitia-ab/j/C1B838AA7F/\"https://apply.workable.com/ignitia-ab/j/C1B838AA7F/ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc0tXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b17158c3683d495dc73630d2bd03b3f52516f5c5/logo.png"
}, {
	"id": "b3eb0069-76f4-4d23-9b41-af3f6040734c",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/b3eb0069-76f4-4d23-9b41-af3f6040734c",
	"created_at": "Tue Jan 26 07:00:07 UTC 2021",
	"company": "TeleSoftas",
	"company_url": "https://telesoftas.com/",
	"location": "Vilnius",
	"title": "Mid – Senior Node.js Developer",
	"description": "TeleSoftas in both Vilnius amp; Kaunas is currently seeking a Mid – Senior level Node.js developer for a challenging and rewarding software development project.pWe are looking for someone who desires to work on a revolutionary product for the music industry and solve complex problems. Together with your team, you would be working on a new global royalty system for music producers, major music labels, and artists.pIf you are proactive, passionate about the quality of software and continuous improvements, can communicate well with the development team, and love solving problems – then it is time to step forward and work together.pcstrongAbout the projectstrongpHave you ever listened to a great song on Spotify 🎶 and wondered how a songwriter gets paid for their creative genius, or how the billions of streams of millions of tracks are processed to pay the right amount of money to the right people? This project is a unique opportunity to be a part of building the intelligent, automated, cloud-native networks needed to run today’s music industry. You will be working with some of the leading experts in the field of big data and cloud technology in the music industry, with fresh and brave ideas aiming to fix the broken legacy pipelines between music users and creators.We are looking for engineers to join this elite team and help them step forward and disrupt the industry.pcstrongRequired skillsstrongpWe are open for a conversation even if you do not meet all the requirements because personality is just as important as the skills!pcolcliTypeScript (Node.js) or Java experience.licliGit.licliTDD / BDD.licliExperience with Amazon Web Services (S3, Lambda, CloudFormation, other).licliFluent written and verbal communication in English.liolcstrongDesired skillsstrongpcolcliExperience with GraphQL apis.licliExperience with event driven architectures (pub/sub etc).licliExperience with AWS CDK (Cloud Development Kit).licliExperience working with Agile methodology and continuous delivery engineering practices.licliExperience with React UI development is a plus.licliKnowledge of Node.js streams.liolcstrongWe OfferstrongpcolcliFull backend position with the potential for full stack development.licliEngineers are responsible for both application and infrastructure code on a cloud native platform.licliTeleSoftas is all about changes and improvement, therefore we have knowledge sharing activities, workshops, training budget, 10% of work time – for learning initiatives, tech library and PluralSight subscription, global amp; local conferences (Spring I/O, Apple WWDC, Google I/O – you name it).licliEach person is unique and the development plan should be unique. That is why we have dedicated cstrongSoft and Tech Team Leadsstrong to take care of your individual development plan and ensure diverse growth.licliWe believe that you should manage your own time, that is why we have a flexible working hour policy and the possibility to work from home.licliBE YOURSELF. When it comes to personality, TeleSoftas has no frames. Get loose. Be weird. Do pyjamas. Do kebabs. Pizza? Have a bad day? It’s ok. Be who you really are. At work is like at home.Rome wasn’t built in a day, was it? Same goes for team spirit. For that, we have a monthly dedicated team-building budget.licliWe believe that engaged employees = happier employees 😊. That’s why every team member is encouraged to take ownership, proactively offer advanced solutions and influence the technical decisions from an early stage.licliWe have a strong cstrongJava and Node.js communitystrong run by the top experts in the field, who have worked on product developments for brands like Sony, Apple and many others.liolcstrongFor this position, we offer 1500-3000 €/month (Netto) salary.strong 💸p",
	"how_to_apply": "ca href=\"https://apply.workable.com/telesoftas/j/BB45635C6D/apply/\"https://apply.workable.com/telesoftas/j/BB45635C6D/apply/ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcnVXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c537dadba8c79a06fbd3c8a1cea7cd40e3939c3e/Telesoftas_logo_Outline_rgb.png"
}, {
	"id": "db0ff9f6-966c-4376-956f-c9f393d9fce8",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/db0ff9f6-966c-4376-956f-c9f393d9fce8",
	"created_at": "Fri Jan 22 15:39:45 UTC 2021",
	"company": "TubeScience",
	"company_url": "https://tubescience.com/",
	"location": "Remote, US",
	"title": "Full Stack Developer",
	"description": "TubeScience is looking for a talented Full Stack Developer to join our thriving team! This role is remote flexible anywhere in the US.pQuick ‘about us’:pWe’re a data-driven video startup based in LA that’s grown to become the largest producer of video ads on paid social in the 4 years since founding. Collectively, our videos account for ~5% of all paid video views on Facebook and Instagram in North America and reach 100-200 million people per day.pWhat You’ll Do:pAs an experienced Full Stack Developer, you will utilize your strong problem solving, communication skills and proficiency working cross-functionally to deliver products end-to-end. You will build maintainable solutions in a fast moving product development environment, where features are rapidly prototyped and tested with users. You’ll also have a critical role on the TubeScience team as we produce tech solutions to support our rapid business growth. You will work with a high degree of autonomy, with high expectations on ownership and collaboration.pObjectives:pWe’re looking for a Full Stack Developer focusing on backend services that can create and tie together creative workflows, big data systems and algorithms. We’re a fast moving startup in a hyper growth phase, so we’re continuously balancing quick high impact solutions with designing for scale. If you’re looking to solve problems that no one else has, apply, we’d love to hear from you.pResponsibilities:pculcliOwn and Develop scalable solutions for internal and external userslicliCollaborate with teammates in an agile development environmentlicliChampion and follow development best practicesliulRequired Skills and Qualifications:pculcli5+ years of software development experiencelicliExperience delivering products end-to-endlicliExperience with Python/Flask or Node developmentlicliExperience working with React, Vue, or similar frameworkslicliExperience working with relational databases (PostgreSQL, MySQL, Snowflake)licliExperience with Amazon Web ServiceslicliPassionate about applying best development practices (Unit testing, linting, etc.)licliCollaborative Team playerlicliExperience working in a structured process (Agile, Scrum etc)liulPreferred Qualifications:pculcliPast ad tech or advertising industry experience is a plusliulBenefits:pculcliExcellent Medical, Dental and Vision CoveragelicliFlexible PTOlicli401k + Matchinglicli$500/yr for Education/TraininglicliMonthly WFH StipendlicliWFH home office set uplicliPersonal CoachinglicliRemote FlexibilitylicliCreative Working EnvironmentlicliPaid Sick LeavelicliDoctor House Call On-DemandliulWhat's atypical about the company:pWe're fast and data-driven: our teams develop concepts in the morning, shoot/edit in the afternoon, launch in the evening, and iterate the next day based on real-world performance.pWe’re a behavioral Ramp;D lab at the core: We put 2,000+ video experiments per week, watched by tens of millions of people per day, that give us deep insights into how people make decisions. Over the past couple years, we’ve built an enormous library of IP around human behavior and visual communication.pWe work on a pure pay for performance basis. Zero production fees for video. Clients only pay us if our videos outperform anything they’re running internally.pOur clients are among the largest advertisers on FB and Instagram, across a wide range of verticals (incl. fashion, beauty, food, fitness apps, healthcare apps, financial services), giving us unique visibility into what drives success at scale. We focus on profitable growth with clients and grow their investment by 80% on average.pApplication Process:pInterested candidates should apply directly for consideration. Upon submitting your application, our hiring team will review your credentials and will notify you if you are selected to participate in the interview process. We appreciate your interest in TubeScience and kindly ask that you refrain from inquiries to our teams via LinkedIn. All questions regarding the status of your application can be directed to ca href=\"mailto:careers@tubescience.com\"careers@tubescience.coma.pNo third party or agency submissions will be acceptedpTubeScience is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We consider all qualified applicants for employment regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification, in accordance with applicable federal, state, and local laws. If you have a disability or special need that requires accommodation, please feel free to contact us at ca href=\"mailto:accomodations@tubescience.com\"accomodations@tubescience.coma.p",
	"how_to_apply": "Click this link to apply: ca href=\"https://tubescience.com/were-hiring/?gh_jid=5039665002\"https://tubescience.com/were-hiring/?gh_jid=5039665002ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbStXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b8a551a3c84317266c1f3dfe846ded212a933e24/TS%20Linkedin%20Logo.jpeg"
}, {
	"id": "19d79848-97bd-45a0-82cb-b4566a994d5e",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/19d79848-97bd-45a0-82cb-b4566a994d5e",
	"created_at": "Fri Jan 22 14:47:22 UTC 2021",
	"company": "Clearbanc",
	"company_url": "https://clearbanc.com/",
	"location": "Remote",
	"title": "Staff Engineer",
	"description": "cstrongWhat your day-to-day will look like:strongpculcliYou’ll have strategic impact over a combination of a large team, a very deep technical problem, and/or a long time horizonlicliYou’ll be a subject matter expert in Clearbanc’s technology stack and an owner of significant components of our code baselicliYou’ll provide considerable guidance across the team, setting short to medium term strategic direction planslicliYou’ll influence prioritization and resourcing with the management team and cross-functional partners to tackle engineering goalslicliContribute to core technological projects as well as experimental worklicliWork in an agile environment with 2 week sprintsliulcstrongYou will thrive if you:strongpculcliHave a strong technical background and enjoy researching new technologies to stay up-to-date in the tech industrylicliHave experience solving open-ended problems - this role will encounter a lot of theselicliHave a track record of creating improvements in business-critical systems around stability, performance, and scalabilitylicliCan work in a hands-on environment, while also taking a step back to act as a team leaderlicliAre comfortable with the ambiguity of an early-stage company. This includes being able to transform product sketches into working technology, as well as working in an environment with a fast paced delivery schedulelicliAre Interested in Clearbanc’s core domain - helping entrepreneurs succeed by building valuable financial and software toolsliulcstrongTechnical Requirements:strongpculcliA Bachelor's or Master’s degree in computer science, software engineering or similar fieldlicli8+ years of experience building web applications with technologies like (but not limited to): TypeScript, Vue and NodelicliProven track record of scaling web applications on top of large, distributed systems with technologies like (but not limited to): RabbitMQ, Kubernetes, Kafka, PostgreSQLlicliThe technologies of the web (HTTP, JSON APIs, REST, HTML)licliSQL database programming and performancelicli*NIX environments, and Operating system details (including processes, threads and file systems)licliData structures and algorithmslicliEnterprise systems and asynchronous architectureslicliWriting maintainable systemsliul",
	"how_to_apply": "ca href=\"https://grnh.se/8ffbf7193us\"Click here to apply!ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXlXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d0331854c07f69c8126758eef43503d7aed1f5db/clearbanc.jpg"
}, {
	"id": "98701506-35a3-4490-807c-73e5f4066d45",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/98701506-35a3-4490-807c-73e5f4066d45",
	"created_at": "Fri Jan 22 02:23:54 UTC 2021",
	"company": "WELL Health",
	"company_url": null,
	"location": "United States",
	"title": "Senior Backend Software Engineer",
	"description": "WELL is a patient communication infrastructure for healthcare. We enable enterprise health systems, private practices, and vendors to conduct seamless conversations with patients across multiple channels — including texting, email, telephone, and live chat.pWith WELL, patients receive all of their healthcare communication from one trusted source — their provider. The platform empowers service representatives to converse with patients in real time, ensuring patients feel heard while driving staff efficiency and increased revenue.pFounded in 2015, WELL is based in Santa Barbara, California and is the highest rated patient engagement software on G2. WELL serves many of the country’s leading health systems and more than 20 million patients.pWELL is honored to be ranked number 170 on the 2020 Inc. 5000 list of fastest growing private companies. WELL is also proud to have been named one of the 2020 Central Coast Best Places to Work by the Pacific Coast Business Times, and one of the 2020 Best Places to Work in Healthcare by Modern Healthcare. Most recently, WELL Health was recognized as one of the Best Midsize Companies to Work for in Los Angeles in 2021 by Built In LA. To learn more about WELL, please visit our LinkedIn.pSUMMARYpWELL is looking for a talented, experienced backend developer to join our fast-paced, growing engineering department. This developer will primarily be working with Node.js. As a Node.js Backend Engineer at WELL, you will work directly alongside a team of bright and motivated backend engineers, under the guidance of our Engineering Director.pYou will be responsible for working with the rest of the team to maintain and grow features in the backend code base. This work will range from supporting Node.js web facing APIs, to writing SQL queries, to developing workflows in Golang.pIn addition to being a strong developer, you will have a keen interest in how software and modern communication channels can improve the patient experience. You will also have the attention to detail and quality needed to meet high Service Level Agreements (SLAs) in a product that serves roughly 20 million patients nationwide. You will also be flexible and adaptable enough to thrive in a fluid startup environment.pRESPONSIBILITIESpBuild new backend services using Typescript on Node.js, open source technology and tools including NestJS.As an experienced engineer, you will help the team adhere to software best practices, level up others in your areas of expertise, and contribute to the architecture of our ongoing refactor project.Collaborate with the product team in an agile environment to break down requirements, plan and estimate tasks.Drive quality by writing effective unit, integration and functional tests for high availability systems and libraries.Create high availability and high throughput systems using Redis, Postgres, Kinesis, S3, MongoDB, and AWS services.Effectively collaborate with Product, QA, UX, Client Success, and other internal groups (both technical and non-technical).pREQUIREMENTSpBachelor's Degree in Computer Science5+ years designing and implementing backend services and distributed systems in a professional environmentStrong grasp of Javascript/ES fundamentals, Typescript, or strong experience in another modern OO languageProficiency in SQL (PostgreSQL) database designExperienced working with asynchronous requests in large scale applicationsCommitment to testing best practicespBONUSpCollaboration/contributions with the open source communityStrong leadership skillsExperience with:Go, PythonDockerTerraformAWSEvent sourced and microservice architecturepLOCATIONpWELL is headquartered in Santa Barbara, CA and has a satellite office in Orange County, CA. Today, all WELL positions are remote, and we are looking forward to when our company returns to in-office work. We are open to candidates that are looking for a permanently remote role depending on their level of experience. Historically, remote team members visit the Santa Barbara office regularly, and we’ve found that works best when they are on the West Coast, specifically in Southern California.pPERKS AND BENEFITSpFantastic company culture – frequent Zoom company events (Lunch amp; Learns, trivia, yoga, etc.) and daily fun brought to you by many creative Slack channels.pWorkplace groups – company committees available for all to join (Diversity amp; Inclusion and Workplace Engagement).pLearning and development – frequent events and tools available to help our employees #PursueGrowth.pCareer mobility – we promote from within and have opportunities for employees to transfer between teams.pSanta Barbara office perks: dog-friendly office, healthy (and unhealthy) snacks, Kombucha on tap, light-filled space, Sonos workplace, ergonomic desk setup, and the occasional taco truck.pMacBook Pros providedpUnlimited PTOpGenerous equity packagepFull health benefits – medical/dental/visionpWELL Health Inc. is an Equal Opportunity Employer and is committed to fair and equitable hiring practices. All hiring decisions at WELL are based on strategic business needs, job requirements and individual qualifications. All candidates are considered without regard to race, color, religion, gender, sexuality, national origin, age, disability, genetics or any other protected status.pWELL is dedicated to creating an inclusive and diverse workplace, where everyone feels safe to be themselves and express their thoughts and opinions. WELL is committed to providing employees with a work environment free of discrimination and harassment; WELL will not tolerate discrimination or harassment of any kind.p",
	"how_to_apply": "Please apply directly here: ca href=\"https://grnh.se/fc7184fd2us\"https://grnh.se/fc7184fd2usap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa1NXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6a48c42a51c008149b27db5e943ff9fa4653a0d8/Well-Blue-Heart-Stroke-with-TM.png"
}, {
	"id": "edcde840-5bc0-4ecd-92f1-21b3e6f4e6e0",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/edcde840-5bc0-4ecd-92f1-21b3e6f4e6e0",
	"created_at": "Fri Jan 22 01:31:48 UTC 2021",
	"company": "Fiddler AI",
	"company_url": "http://http",
	"location": "Palo Alto, CA ",
	"title": "Frontend Engineer",
	"description": "cstrongOur StorystrongTrust is a fundamental part of humanity, but with the rise of the internet over the last couple of decades, we’ve seen a plethora of trust issues emerge like spam, fraudulent transactions, hate speech, and online abuse. Today, with AI, computers take on more tasks usually done by humans, with an increase in efficiency and productivity. However, We understand the implications of AI, and the potential danger of not having visibility into how it affects the real world. There is a lack of trust in AI outcomes because often AI models can be opaque.   We started Fiddler because we believe there is a need for a new kind of Explainable AI Platform. One that enables organizations to get ahead of these issues by building trustworthy, transparent, and understandable AI solutions.pcstrongWho We ArestrongOur team is motivated by helping the world to unlock the AI BlackBox. We help humans harness AI to create more understanding around results, create actionable insights, eliminate biases, and identify performance gaps. We know that AI is the future and believe that learning the “why” behind the results is crucial to any business or platform.pWe are still an early-stage startup, and are rapidly growing our team! This is an exciting time to join an XAI startup that is quickly becoming a leader in the space.pFiddler Labs is recognized as a pioneer in the field of Explainable AI and has received numerous accolades, including 100 most promising Technology Pioneers of 2020 by the World Economic Forum, Forbes 50 most promising AI startups, and a Cool Vendor in Gartner’s 2019 Cool Vendors in Enterprise AI Governance and Ethical Response report.We are looking for a design-oriented and collaborative Frontend Engineer to help us continue to build this platform.pcstrongWhat You'll DostrongDesign, build, support, and own the front-end components of our enterprise software product, including UIs and visualization for AI explainability and monitoringWork with data science teams to understand their requirements, and our design / product team do design clear, simple data visualizations and intuitive interfacesWork with the technical and product team to iterate on different user interfaces, and continuously look for ways to improve the customer usability experienceCreate reusable and maintainable frontend systemspcstrongWhat We're Looking ForstrongBS/MS in Computer Science or equivalent industry experienceDeep experience with React, Javascript, and Redux. Experience with Node.js, Enzyme, and Jest is a plusStrong product and design sensibilities, with an attention to detailAbility to rapidly iterate on designs, in a highly collaborative environmentExperience related to javascript plotting tools such as D3, highcharts, etc.Understanding of asynchronous javascript handlingAbility to leverage and modify front-end components like bootstrap, semantic UI or material UIp",
	"how_to_apply": "Apply here: ca href=\"https://jobs.lever.co/fiddlerlabs/c6c9be0b-1c12-4803-b3af-c17fe043f269\"https://jobs.lever.co/fiddlerlabs/c6c9be0b-1c12-4803-b3af-c17fe043f269ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa0tXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f2edb3c4fc78f6558cda597c95a6c0b3c1e5cd40/Logo%20200px.png"
}, {
	"id": "666fce14-804b-42d4-bf28-0f79e71c1fd3",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/666fce14-804b-42d4-bf28-0f79e71c1fd3",
	"created_at": "Thu Jan 21 20:42:15 UTC 2021",
	"company": "Stukent",
	"company_url": "https://www.stukent.com/",
	"location": "Idaho",
	"title": "Software Engineer with Growing Ed-Tech Company",
	"description": "ch2What is Stukent?h2Stukent is a digital courseware provider focused on producing first-in-the world simulations and etextbooks to hundreds of thousands of students around the world. Not only does Stukent provide up-to-date textbooks, but hands-on courseware for instructors and students alike. Our mission is to help educators help students help the world. We take pride in our growth (#268 in the Inc. 500), excellent office culture and the development of our employees.pch2Job Descriptionh2We are on the hunt for ambitious software engineers. A software engineer at Stukent takes initiative in their unique ideas while continuously improving their technical knowledge. With their team, software engineers design, code, test, deploy, troubleshoot and analyze applications to constantly improve Stukent products. As new products are being produced, a software engineer will implement their technical and creative skills on these products.pch2Essential Duties and Responsibilitiesh2Be responsible for programming enhancements and changes to current Stukent productsHelp shape and develop the vision of Stukent and it’s growing productsCollaborate with other software engineers in addressing the technical needs of the companyWork with Agile Teams, Product Owners, Designers and Agile Lead to ensure effective implementation of softwareAttend ceremonies relevant to the products you are assignedTroubleshoot and debug applicationspch2Knowledge, Skills and Abilities Requiredh2Bachelor’s Degree in Computer Science or equivalent work experience3-5 years experience designing software and writing production code in a team setting requiredFast learner with a passion to lifelong and continuous learningOutstanding written and verbal communication skillsExcellent problem solving skillsUnderstanding of Agile Software Development MethodologyProficient in modern web application frameworks (Angular/React)Proficient in modern application processing frameworks (.NET, node, .etc)Experience with Ruby and Rails is a bonuspCheck out our Tech Stack: ca href=\"https://stackshare.io/stukent/stukent\"https://stackshare.io/stukent/stukentap",
	"how_to_apply": "Complete application at: ca href=\"https://stukent.bamboohr.com/jobs/view.php?id=37\"https://stukent.bamboohr.com/jobs/view.php?id=37ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa0dXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--52bdb31512804702ca08693e7d34a00358ac8e8e/logo.png"
}, {
	"id": "4c38e5a7-6ecd-478f-9571-4f83845c2833",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/4c38e5a7-6ecd-478f-9571-4f83845c2833",
	"created_at": "Thu Jan 21 15:20:37 UTC 2021",
	"company": "Telmar",
	"company_url": "http://Telmar",
	"location": "UK remote",
	"title": "Full Stack Software Engineer - Fully Remote",
	"description": "ROLE SUMMARYpReports To: Engineering Resource ManagerRemote working and Flexible hourspAbout Telmar:Telmar was purchased by LiiV in 2018  and is a provider of SaaS/software to advertising and media companies, providing the most influential agencies, media owners and planners with innovative cloud-based tools to help create, plan and predict the most successful media campaigns. With over 50 years of experience providing data and analytical tools for the marketing and advertising industry, Telmar’s easy-to-use software products and solutions support over 8,000 databases, making it the industry’s most trusted third-party data analysis software globally.pIn the role of Full Stack Engineer, you will be responsible for designing, developing, and maintaining applications that are deployed on our cloud-delivered Telmar Unified Platform, our end to end media planning and buying web based solutions that span all media types globally.pAn example module is our Out of Home Application, a product which provides a comprehensive outdoor advertising planning system with detailed site level and market average reach and frequency evaluation.pAs a Full Stack Engineer you are a crucial part of a dynamic agile team, you will collaborate with very experienced technologists in the media planning industry and will have an awesome opportunity to build cutting-edge technology essential to the media planning industry.pMain Responsibilities and Tasks:Collaborate closely with the team to plan, prototype, scope and develop frontend and backend web application components/featuresUse Git version control system, create, build and deploy company internal npm modules and packagesTest, measure, optimize performance, and engage in continuous improvement using appropriate toolsBuild and use various customized tools: deployment scripts, build tools, etc.Have security as a primary concern in the architecture, build and deployment of solutionsMentor less experienced Engineers and provide the learning framework to support learning.pPERSON SPECIFICATIONpEducation, Experience, Knowledge, and Skills:General programming and knowledge of Javascript, TypeScript, DOM manipulation, Javascript object model to implement rich, interactive web applicationsProven experience with Frontend Angular development, Node.jsExperience of Git and conducting code reviewsAdvanced demonstrated fluency in JavaScript, HTML, and CSSKnowledge and understanding of AWS Gateway API, AWS Lambda (Node.js), ElasticSearchExperience of implementing UI/UX design using Material UIKnowledge of HTML5, CSS3A good understanding of RESTful APIs, JSON data objectsExperience with Agile methodologies and change management i.e. Jira and be able to author technical acceptance criteriaKnowledge of modern authorization mechanisms, such as JSON Web Token, Amazon Cognito and Amplify Auth frameworkpPersonal Attributes:Excellent problem-solving skillsAbility to keep up to date with advances in Technology and best practices from the industry.Proven ability to work effectively in a distributed working environmentOutstanding written and verbal communication skillsOrganized, detail-oriented, and deadline-drivenStrong interpersonal skills and the ability to work proactively, independently and as a team playerAbility to work efficiently and productively in a fast-paced environmentWillingness to learn new skillsp",
	"how_to_apply": "Please apply via the link below:ca href=\"https://liiv.bamboohr.com/jobs/view.php?id=55\"https://liiv.bamboohr.com/jobs/view.php?id=55ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUtXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9f27a4aea54de02611c954ffb0b13d0dbd333d4f/telmar-LiiVco-Logo-blue%20(2).png"
}, {
	"id": "35842a28-ff88-47ba-99e5-f9960ae901a4",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/35842a28-ff88-47ba-99e5-f9960ae901a4",
	"created_at": "Wed Jan 20 20:13:28 UTC 2021",
	"company": "Mastermind",
	"company_url": "https://mastermind.co",
	"location": "Remote",
	"title": "Startup Software Developer",
	"description": "The Pandemic has turned the world upside-down and created an enormous opportunity to reinvent virtual learning. Mastermind is a high-growth, remote-first startup founded in 2020 focused on building a platform for Creators and next-gen teachers to share their passion/knowledge with the world and monetize their following with LIVE Courses and other virtual experiences.pFounded by repeat entrepreneurs Chris Sukornyk (formerly Chango) and Candice Faktor (formerly Wattpad) in 2020 you would be joining on the ground floor with and incredible team backed by major investors (yet to be announced). Come create the future of learning! You'll work on a small and extremely agile team, iterating rapidly toward the elusive Product-Market Fit. We hire for character first, skills second. Passion, curiosity and drive wanted!pAbout the RoleIn your role as a full stack developer, you'll be working closely with a fast-moving product and technology team to push our product in new directions while also shaping the next iterations of the features our customers already love. You'll define the future of core pieces of our product across areas such as payments, reporting, security, video conferencing and more. From front-end usability to back-end algorithms, you'll hone your skills across multiple domains while helping to drive the product and vision forward.pSome of the responsibilities of a full stack developer at Mastermind are:pculcliPerform end to end engineering of Mastermind’s core product from design, develop, test, release, deploy, upgrade and productionlicliPerform code reviews for your peerslicliWhen required, participate in production support, including deployment, training and setting up and incident responselicliContribute to automation tools to aid development, testing and delivery of customer and product requirementslicliTake individual responsibilities to drive timely execution of projects and sprints, including estimates, status update and reviewslicliUphold the quality of the product or features, including unit test, functional test, integration, performance, security and scalabilitylicliUnderstand and contribute to company best practices for code quality and velocitylicliParticipate in architecture design and decisions, communicate significance/impact of a solution with the rest of the teamlicliProduce documentation on code, system design, architecture and solutionsliulSkillspculcli2-5 years of industry experience building fast, reliable, real-time web-based applicationslicliExperience with NodeJS and React or similar technologieslicliA deep understanding of Typescript and Javascript APIslicliKnowledge of relational and non-relational databaseslicliExperience in working with modern build toolslicliUnderstand of common Design Patterns, OOPS concepts and SOLID design principleslicliA self-starter with a strong desire to work on a small collaborative team in an agile environmentlicliAbility to collaborate with cross-functional team memberslicliA pragmatic, customer-first, and get-things-done kind of attitudeliulBenefits and PerkspculcliTalented, passionate and collaborative team who will support and inspire youlicliPersonal growth plans that let you stretch yourself or grow in new directionslicliAnnual health amp; wellness stipendlicliAnnual online courses stipendliul",
	"how_to_apply": "Email your resume to ca href=\"mailto:work@mastermind.co\"work@mastermind.coap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZytXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--431ee4b4de491ec2987b3d94250445b3ea5c0186/logo-small.png"
}, {
	"id": "c34a9766-5aab-4bba-b485-ba1e77ec8a6e",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/c34a9766-5aab-4bba-b485-ba1e77ec8a6e",
	"created_at": "Tue Jan 19 12:45:03 UTC 2021",
	"company": "CompuGroup Medical SE  Co. KGaA",
	"company_url": "https://vonq.io/3bPiMGR",
	"location": "Koblenz oder Home Office",
	"title": "Fullstack-Entwickler React/Java (m/w/d) Clickdoc Videosprechstunde",
	"description": "ch2CompuGroup Medical hilft heilenh2CompuGroup Medical liefert wichtige Software, um Gesundheit und Lebensqualität zu verbessern. Wir bauen Brücken zwischen Ärzten, Apothekern, Kostenträgern, Laboren, Reha- und Pflegeeinrichtungen und Krankenhäusern und helfen ihnen, Menschen optimal zu versorgen. Die Arbeit aller medizinischen Leistungserbringer zu verstehen und immer mehr zu erleichtern ist unser Ziel. Seit über 30 Jahren unterstützen wir unsere Kunden, Informationen sicher zu speichern, auszutauschen und Wissen abzufragen.pculcliFührendes internationales e-Health Unternehmenlicli746 Mio. € Jahresumsatz in 2019licliCa. 6100 Mitarbeiter weltweitlicliEinzigartige Kundenbasis mit über 1 Mio. professionellen Nutzern weltweitlicliStandorte in 18 und Produkte in 56 LändernlicliÜber 30 Jahre erfolgreich im Marktliulch2Als Fullstack-Entwickler React/Java (m/w/d) Clickdoc Videosprechstunde gestalten Sie heute schon mit, was die Zukunft bringt!h2Unser Produkt CLICKDOC PRO bringt Ärzte und Patienten über digitaleTerminvereinbarungen und Sprechstunden schnell und sicher zueinander - über alle Endgeräte hinweg. Wie unsere rasant anwachsende Nutzerbasis wächst auch unser Team. Sie sind ein Softwareentwickler (m/w/d), der den Deep-Dive ins Gesundheitswesen sucht? Und nebenbei mit seinem Code Prozesse verbessern will, die einen maßgeblichen Beitrag zur Verbesserung des Gesundheitswesens leisten? Dann freuen wir uns auf Sie!pch2Ihr Beitrag:h2culcliIn einem agilen Team (Scrum) arbeiten Sie als Softwareentwickler (m/w/d) an der Weiterentwicklung unserer Plattform für die sichere Videokommunikation für Ärzte und KrankenhäuserlicliHier arbeiten Sie mit Technologien wie ReactJS, HTML CSS, WebRTC und NodeJS sowie Java, Hibernate, Spring Boot und GroovylicliÜber Code Reviews, Unit- und Integrationstest und Dokumentationen sichern Sie Ihre Arbeit übergreifend abliulch2Was uns wichtig ist:-h2culcliSie verfügen über eine abgeschlossene Ausbildung, z. B. als Fachinformatiker (m/w/d) oder ein abgeschlossenes Studium im Bereich IT, z. B. in Informatik, Software Engineering oder Computer ScienceslicliSie bringen Berufserfahrungen eines modernen Javascript Framework (React, Angular oder VueJS) mitlicliAußerdem besitzen Sie Kenntnisse in Hibernate, Spring Boot, Groovy, WebRTC und NodeJS und kennen sich mit MySQL und REDIS auslicliFließende Deutsch- und Englischkenntnisse runden Ihr Profil abliulch2Was Sie von uns erwarten können:h2culcliFreiraum für Ihre Ideen innerhalb eines internationalen und hochspezialisierten Marktführer-UmfeldeslicliEine hohe, agile Lernkultur und engen Zusammenhalt im TeamlicliFlache Hierarchien und kurze Entscheidungswege innerhalb der AbteilungenlicliModerne Technologien innerhalb eines stabilen Tech-StackslicliVielfältige Weiterentwicklungsmöglichkeiten und langfristige Perspektiven innerhalb des UnternehmenslicliZuschuss zur betrieblichen Altersvorsorge als Baustein einer sicheren ZukunftlicliZugang zu Rabatten und Sonderangeboten für MitarbeitendeliulSie erleichtern es uns schnell richtige Entscheidungen zu treffen, wenn Sie uns über das cstrongBewerbungsformularstrong Ihre aussagekräftigen Unterlagen mit Ihren Gehaltsvorstellungen übermitteln.pcstrongSynchronizing HealthcarestrongpcstrongWerden Sie jetzt ein Teil davon!strongpKennziffer:pcstrongreq5497strongpStandort:pcstrongBünde, Koblenz oder Home OfficestrongpJob Segment:pcstrongSoftware DevelopmentstrongpKontakt:pcstrongca href=\"mailto:career@cgm.com\"career@cgm.comastrongpca href=\"https://vonq.io/3bPiMGR\"Klicken Sie hier um zum Bewerbungsformular zu gelangen!ap",
	"how_to_apply": "ca href=\"https://vonq.io/3bPiMGR\"Klicken Sie hier um zum Bewerbungsformular zu gelangen!ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDZWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c92809e47ffac98fb21e3cbe8567ee36d33d1a2e/Compugroup.jpg"
}, {
	"id": "4646eee5-f831-461e-affa-b2efe098f61d",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/4646eee5-f831-461e-affa-b2efe098f61d",
	"created_at": "Tue Jan 19 11:20:30 UTC 2021",
	"company": "Cactus Communications",
	"company_url": "https://cactusglobal.com/",
	"location": "Remote",
	"title": "Frontend Developer",
	"description": "The opportunity:pJoin us and be a part of a start-up cell of a large international company, where you will be working with state-of-the-art technology, make use of NLP and Machine Learning, and where your career can grow exponentially.pYou will be part of the Paperpal team powered by CACTUS, where we are rethinking how science is communicated and helping scientists write better science smarter. You will be part of an international working environment, with employees across the EU and Asia, who work together to build cutting-edge web experiences and APIs used globally by scientists.pThis is a remote working opportunity.pResponsibilities:•Write new functionality in an existing frontend framework, a modern tech stack with React, Node.js, Redux and Typescript, with focus on the Typescript part of the stack•Working with tools, technologies and plugin architectures that will challenge your abilities to write and work in asynchronous editing scenarios to achieve best-in-class results for users•Work with advanced Typescript features like generators, iterators, currying, types (intersection, union, etc.), pipeline operators, symbols and others where necessary and meaningful•Build and release software through Jenkins, onto an AWS microservice architecture using Docker•Being part of a small team of about 3-4 people, participating in stand ups, and delivering code into this team•Being part of code reviews of your and other people's codepRequirements (Desires skills amp; experience)•You have at minimum 4 years (including side projects, student jobs, etc. Does not include code written as part of a university degree) experience programming in Typescript•Some knowledge of UI frameworks like React or Angular is nice to have, but not required•Some knowledge of state management libraries like Redux, MobX or NgRx is nice to have, but not required•Some knowledge of integration with the online word processors in Office 365 or Google Docs is nice to have, but not required•You have knowledge of best practices in frontend development around Typescript, types, asynchronicity and text editing•You are motivated, curious and independent, with a desire to learn, and be a part of a growing company.•You are motivated to learn from people with deep industry insights – but also willing to challenge and question decisions, and ask intelligent questions.pAbout us:pCactus Communications is a technology company accelerating scientific advancement. We collaborate with researchers, universities, publishers, academic societies, and life science organizations. We offer editorial, translation, education, and training solutions for researchers; strategic and tactical scientific content solutions to global life science organizations; AI-powered scholarly publishing solutions for journals and researchers; and solutions for science dissemination and engagement with peers, public, and policymakers for wider research outreach. We also incubate seed and early-stage startups that share our mission to solve global problems with science and technology solutions.pWe have offices in London, Princeton, Singapore, Beijing, Shanghai, Tokyo, Seoul, Aarhus, and Mumbai; a global workforce of over 3,000 experts; and customers from over 190 countries.p",
	"how_to_apply": "Email your CV to ca href=\"mailto:bilaludn.sheikh@cactusglobal.com\"bilaludn.sheikh@cactusglobal.comap",
	"company_logo": null
}, {
	"id": "fc829ec9-cf3b-4ca6-bce4-edf492f9f62c",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/fc829ec9-cf3b-4ca6-bce4-edf492f9f62c",
	"created_at": "Mon Jan 18 10:08:02 UTC 2021",
	"company": "Workist GmbH",
	"company_url": "https://workist.com/",
	"location": "Berlin",
	"title": "(Senior) Backend Engineer",
	"description": "Millionen von Menschen weltweit arbeiten in administrativen Jobs und verrichten Tag für Tag stark repetitive Arbeiten. Wir glauben, dass das Kopieren und Einfügen von Daten aus Dokumenten in andere IT-Systeme nicht die heutige Antwort auf die Zukunft der Arbeit sein kann. Wir wollen das ändern und einen Arbeitsplatz mit weniger Monotonie und dafür mehr Wirkung, Kreativität und Zweck schaffen!pUnsere Vision bei Workist ist es, künstliche Intelligenz einzusetzen, um repetitive Aufgaben zu automatisieren und den Menschen die Freiheit zu geben, das zu tun, was sie lieben.pWir wurden 2019 in Berlin gegründet und werden von erfahrenen Serial Entrepreneurs und VCs unterstützt. Wir haben ein starkes Team mit diversen Hintergründen und Erfahrung von McKinsey, SAP, IBM, Minodes, Voi, MIT, KIT, Uni Mannheim und LMU amp; TUM. Mit unserer kürzlich aufgenommenen Seed-Finanzierung wollen wir unsere Aktivitäten ausweiten und suchen nach leidenschaftlichen und talentierten Mitarbeitern, um das Produkt und das Unternehmen auf die nächste Stufe zu bringen.pcstrongDeine AufgabenstrongpculcliDecide on technical architecture and infrastructurelicliDevelop software along our Definition of donelicliDevelop software in the entire tech stacklicliProvide feedback to team members on where and how to improvelicliHelp out and mentor other team members to ensure overall development quality amp; velocitylicliTake “Continuous improvement” seriously by identifying opportunities for streamlining work and reducing wastelicliBe accountable for service levelslicliWrite documentation where necessarylicliTake care of IT Security and Data PrivacyliulcstrongDein ProfilstrongpWe’re looking for people that are passionate about what they do and ready to take over responsibilities. We’re creating a work environment where people should follow their curiosity and have a strong urge to put the business forward to help fulfill our mission.pSince you will work very closely with our founding team on our AI Technology we believe it is important that you feel comfortable with at least some of the points below.pculcliFluent in Python or if you consider yourself polyglotlicliExperience with Django, Flask or similarlicliExperience in setting up cloud infrastructure with terraformlicliKubernetes ExperiencelicliCI/CD ExperienceliulIt would be even greater if you find your self in the next list:pculcliDue to our customer base, German is a pluslicliSome first experience with Machine LearninglicliExperience working with GraphqllicliExperience with Typescript, React JS and ApolloliulcstrongWarum wir?strongpDo you want to really take over responsibilities and do not face micromanagement from an incompetent boss? Then you’re at Workist in the right place. We commit as founders and as a company to build an organization that promotes domain ownership and gives people the freedom to decide within their domain independently. This does not mean that you’re on your own.pOn the contrary, we believe in teamwork and helping each other out. We want to achieve great things together and believe in working in small iterations towards a big goal. Therefore we follow agile best practices in business and tech teams and set sprint, quarterly, and yearly goals to work efficiently towards them. Everyone is welcome to contribute to our company goals and also raise red flags when something is not going as planned.pculcliActively shape an early-stage SaaS startuplicliTake on ownership from day onelicliFlat hierarchy with an open and transparent communication culturelicliFlexible work from home policy and an office in the heart of BerlinlicliRegular (virtual) team eventslicliCompetitive salary, extensive individual feedback sessions, and great opportunities for career progressionliulcstrongUnser Tech StackstrongpWe believe in operational excellence along with our development and research tasks. Therefore we have code reviews and a fully automated CI/CD pipeline to help to bring ideas from theory to production as smooth and fast as possible. You build code, ship, and maintain your applications in our stack:pculcliAI-Stack: Detectron2, Pytorch, Tensorflow, Scikit-learn, CUDA (Tesla V100s),licliFront-End: React JS, Graphql (Apollo)licliBackend-End: Grahpql, Python, Django, FlasklicliDatabase: Postgres, Elastic Search, Blob StoragelicliDev Ops/Infrastructure: Gitlab, Terraform, Kubernetes, Docker, MS Azure, AWSliulcimg src=\"https://camo.githubusercontent.com/0c214862134e119495370739daaa7edd791b47a9/68747470733a2f2f742e676f686972696e672e636f6d2f682f35623964653661666138623135353136396231333065386635316538343037343366613231626234643539326536383730393966353363373532326464353436\"p",
	"how_to_apply": "ca href=\"https://t.gohiring.com/h/512aef07b9e5ef06bb5767c7ae34d7e0ab8c8302c0f615231553baeae92a7ab2\"application formap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckNWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d15c9a5524ae780e7386e6569c40b0bbabc092e1/Workist%20GmbH.png"
}, {
	"id": "539b897b-3ead-4ff0-aabe-03d16d82134f",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/539b897b-3ead-4ff0-aabe-03d16d82134f",
	"created_at": "Sat Jan 16 06:47:39 UTC 2021",
	"company": "Earnest",
	"company_url": "https://grnh.se/6193983d1us",
	"location": "Remote",
	"title": "Software Architect",
	"description": "We will set you up with all the necessary tools to perform the job from your home office.pEarnest empowers people with the financial capital to live better livespWe're an accomplished team of design, math, finance and technology geeks who believe consumer lending can be radically improved and are doing something about it. We created a company that combines data science, streamlined design, and technology to:pBuild products that simplify the lending process,Provide them to more people, andEngage with our customers through more human experiences.pAs a Software Architect at Earnest, you will report to the Senior Manager of Platform Engineering, provide technical direction, and build the software that is revolutionizing consumer lending, automating the loan approval process and orchestrating the transfer of billions of dollars. In addition to the $10+ billion in loans serviced, we build tools to maximize Earnest's growth while providing the best possible client experience. Our focus is on building a modern platform that allows us to move faster over time. This means a willingness to rethink domains from first principles and an ability to collaborate well across technical and non-technical teams.pAt Earnest, we use Node.js and TypeScript on the server-side. On the front-end we use React/Redux for building new things and Angular for everything else. We deploy services in Docker and Kubernetes on AWS. We integrate with other internal microservices (written in Node.js and Scala) and store the bulk of our data in Postgres and Amazon S3.pWhat you'll do:pculcliDrive systems architecture redesign while working with other stakeholders.licliArchitect and implement domain-based microservices, such as user service, loan service, etc.licliPrototype solutions for the broader engineering teams, such as a message bus for asynchronous communication between backend services.licliCreate engineering requirement documents and assist with planning of new features and bug fixes.licliMentor and provide guidance on engineering best practices to team members.licliLaunch new features such as an integration with strategic partners, such as Optimizely and Plaid.licliWork with Product, Design, and Engineering Management on priorities with the team.liulIdeal background and expertise:pculcli10+ years of professional development experiencelicli2+ years of experience architecting distributed software systemslicliExperience with server-side concepts, e.g. microservices, database, caching, performance, - monitoring, scalabilitylicliExperience with Node.js preferredlicliExperience working in Fintech, Banking, or related Consumer Financial Services companies is a plusliulEarnest Perks amp; Benefits:pculcliHealth, Dental, amp; Vision benefits plus savings planslicliEmployee Stock Purchase Planlicli401(k) plan to help you save for retirement plus a company matchlicliTuition reimbursement programlicli$1000 Travel perk on each Earnie-versary to anywhere in the world and 25 days of annual PTOlicliGreat culture with an awesome teamliulEarnest provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, sexual orientation, disability, genetics, gender identity or expression, or veteran status. Qualified applicants with criminal histories will be considered for the position in a manner consistent with the Fair Chance Ordinance.p",
	"how_to_apply": "Click on this link to apply: ca href=\"https://grnh.se/6193983d1us\"https://grnh.se/6193983d1usap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDJWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f6fc9e5127adff6d5f75495b7634c6c39d4b0aac/earnest-logotype-green.png"
}, {
	"id": "3d4fbfba-4f19-4ee7-8855-d81b352166a3",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/3d4fbfba-4f19-4ee7-8855-d81b352166a3",
	"created_at": "Fri Jan 15 11:45:32 UTC 2021",
	"company": "Positive Minds GmbH",
	"company_url": "https://www.positiveminds.io/en/",
	"location": "Dresden",
	"title": "Developer / Solution Engineer (f/m/d)",
	"description": "For our young start-up company, dedicated to building first-class customer experiences, we are seeking a Developer / Solution Engineer (f/m/d) in Dresden, Leipzig or Jena for a permanent full-time position.pYou will be part of our solution engineering team with excellent career opportunities that offer leadership in technology combined with strong understanding of our customer needs. We have always differentiated from other teams with our unique hands-on approach that limits team size to people who stay close to our customers and translate their business needs into best in market technical solutions.pContinuous learning and delivery of results are the core features we are looking for. A passion for software craftsmanship and a commitment to open and honest feedback complement these characteristics.pcstrongTasksstrongpYou will participate in and finally lead architecture discussions with our clients as well as our architects and platform team to help define best approaches. You will also participate in design reviews and recommend improvements. You will be part of a team that is committed to writing test-backed, clean and reusable code.pYou ...pculclitake an active role in the development process of customized omnichannel solutions.licliparticipate in all phases of software development: from architecture and design to development and testing in an agile team using the Scrum model.liclicontrol the complete stack from backend to web applications, develop new features in close cooperation with all involved teams.licliassist in risk assessment and mitigation activities.licliapplication development and implementation, as well as technical reviews in the postlaunch-phase.liulcstrongRequirementsstrongpAs an experienced Developer / Solution Engineer you are able to identify problems through critical thinking, you have analytical skills and in addition to your technical strengths you distinguish yourself through self-confidence, independent working methods, teamwork and clear communication?pYou ...pculclihold an University degree or successfully completed an IT related education program.licli5+ years of professional development experience ideally using ReactJS, JavaScript/TypeScript, Python, Golang, NodeJS or similar languages.licliconfident with AWS Cloud components and relevant services, e.g. Serverless, Lambda, DynamoDE, Mocking, SQS Scalbility, API Gateway, CloudWatch, EMR, S3, EC2liclihave experience with business critical SaaS applications based on MicroServices Architecture.liclihave the general understanding of Service-Oriented approach, Domain-Driven Design, S.O.L.I.D. principles.liclihave experience collaborating with other Engineers in planning, prioritizing and executing assigned tasks within deadlines.liclidevelop CI/CD-conform and test compatible code.liclideveloper experience in Salesforce with Service Cloud or Sales Cloud is also advantageousliclihave good written and spoken English language skills.liulcstrongBenefitsstrongpculcliExcellent personal and professional opportunitieslicliFast and short decision pathslicliFlexible work organization with home office possibilitieslicliFree choice of your work tools: Work with a Macbook Pro or use open systems such as Linux or Windows.licliTeam meetings and events - professional and funlicliAnd of course a great atmosphere in the teamliul",
	"how_to_apply": "ca href=\"https://positiveminds.join.com/jobs/1737952-developer-solution-engineer-f-m-d?pid=357a3b4531918760973famp;utm_source=github_jobsamp;utm_medium=paidamp;utm_campaign=single%2Bpostingamp;utm_content=developer%2Bsolution%2Bengineer%2Bf%2Bm%2Bd\"https://positiveminds.join.com/jobs/1737952-developer-solution-engineer-f-m-d?pid=357a3b4531918760973famp;utm_source=github_jobsamp;utm_medium=paidamp;utm_campaign=single%2Bpostingamp;utm_content=developer%2Bsolution%2Bengineer%2Bf%2Bm%2Bdap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1NWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--35b2bd07e6dcc292c36523b525bc769289f11f20/positive%20minds.png"
}, {
	"id": "6f7ca396-7c8f-4cac-9e3d-40a95ef4e333",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/6f7ca396-7c8f-4cac-9e3d-40a95ef4e333",
	"created_at": "Wed Jan 13 17:17:15 UTC 2021",
	"company": "Vaultoro",
	"company_url": "http://www.vaultoro.com",
	"location": "Berlin",
	"title": "Back End Developer",
	"description": "Vaultoro Limited is an international Fintech company operating since 2015, the world's first exchange platform where users from +94 countries trade precious metals and cryptocurrencies. Our business is rapidly expanding and we offer challenging tasks in a dynamic and multicultural environment. Our -corporate values include creative freedom, ownership of responsibilities, a flat hierarchy, high performance and professional guidance in the expanding Fintech industry. Join our Berlin office and become part of our core team, creating the future of the crypto economy.pcstrongWhat we are looking forstrongWe are searching for a knowledgeable developer, fluent in all things Javascript who wants to be part of a friendly growing team. We’re based in Berlin but we’re happy if you’re remote.pcstrongRESPONSIBILITIESstrongpculcliWorking with our founders to build and scale our trading platformlicliUnderstanding the DevOps process from start to finishlicliBuilding backend serviceslicliDelivering high-quality and well-structured code in a timely mannerliulcstrongQUALIFICATIONSstrongpculcliA minimum of 3 years of professional web application developmentlicliExperience working with Javascript, Mongodb, Redis, Docker, NodeJS,liulcstrongNICE TO HAVEstrongpculcliAn interest in cryptocurrencieslicliKnowledge of Kubernetes, Go and Cloud service providers.liulcstrongBENEFITSstrongpculcliCompetitive remunerationlicliFlat hierarchylicliUnique opportunity to make an impact on a growing start-uplicliAbsolute and encouraged creative freedomlicliAn amazing office space in Berlin (with garden)licliBeing part of an expanding team and departmentlicliUnlimited coffee and tealicliRegular team eventsliulIf building an alternative financial system sounds interesting to you, apply to work at Vaultoro! Send your CV, Cover letter, first available entry date and desired salary to ca href=\"mailto:jobs@vaultoro.com\"jobs@vaultoro.comapWe strive to to provide equal employment opportunity to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status etc.p",
	"how_to_apply": "Email your CV to ca href=\"mailto:jobs@vaultoro.com\"jobs@vaultoro.comaSubject: Github Back Endp",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbEtWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--439c426a666188b0a1b239aceb72fa16d1a5417c/logo-transparent.png"
}, {
	"id": "e55930c6-0db3-4fad-ab97-094b074a3648",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/e55930c6-0db3-4fad-ab97-094b074a3648",
	"created_at": "Wed Jan 13 15:59:23 UTC 2021",
	"company": "Excelerate America",
	"company_url": "https://www.excelerateamerica.com/",
	"location": "Detroit, MI",
	"title": "Back End Developer",
	"description": "ch2Company Overview:h2Excelerate America (EA) is a network for small business entrepreneurs to transform their businesses from small to mighty. Collaborating with a diverse set of partners and communities, EA brings together a community wanting to help each other thrive; through inspiration, problem-solving, and access to curated products and services. The next phase of EA’s growth is to develop a dynamic and engaging mobile community platform driven by peer-to-peer problem-solving. This platform will help EA scale and connect its existing communities to power-up entrepreneurs' abilities to work together, get guidance from peers, and have a greater impact in their local communities.pch2Job Overview:h2The Backend engineer works as a leading member of EA’s growing software and product technology team to help architect, develop, and launch EA’s platform.pAs a critical member of the product team, the Backend Engineer will work closely with the founding leadership and product development team to architect EA’s data structure, learning algorithms, and front-end integrations to build a platform that delivers a personalized and cutting edge experience to our users and partners. You will be one of the founding software engineers working closely with our Engineering Lead to design our new platform, help to scale it, and establish the way we work as a software-oriented organization. We are a company focused on our users and instill a human-centered approach, thus giving you the opportunity to go beyond development and participate in the design and creative thinking needed to build an exceptional end to end platform for our members.pExcelerate America is a Detroit-based organization. We believe in a flexible work environment with 3 days in-office, 2 days remote approach to allow for cross-disciplinary collaboration. The Back End Engineer role is preferred to be co-located in Detroit with the product team. Remote will be considered.pch2Responsibilities and Duties:h2culcliWork with EA Dev team to develop EA APIs and EA Server-side Apps and documentationlicliDocument and test all EA APIs and EA Server-Side Apps and help build a culture of testing throughout our build processlicliSetup, configure and monitor the various EA servers, hosting, and databases including dev, staging, production for both EA marketing sites and EA platformlicliSetup, maintain, test, and create authentication, payment, and other gatewayslicliSetup repos in Git and workflows for continuous integrationlicliTroubleshoot server issues and performance bottleneckslicliCapable of scaling applications to handle the load changes.licliDesign, implement, maintain and automate the appropriate backup and recovery architecture as requiredliulch2Qualifications:h2culcliBachelors of Computer Science or equivalent learning/experiencelicli5+ years of experience in engineering including experience building, launching and scaling a consumer or enterprise product or platformlicliDeep understanding of NodeJs programming language and framework, including the development and optimization of server-less functionslicliDeep understanding of databases NoSQL, MySQL as well as experience with and/or familiarity with GraphQLlicliProven experience working with multiple disciplines including business, front-end, and design and enjoy a highly collaborative environmentlicliExperience with agile development and/or sprint-based developmentlicliAbility to set up development and production environments or the engineering teams including virtualization and container technology, GIT, and continuous integration workflows..licliKnowledge of security, privacy, and compliance as it applies to online users and payment gatewayslicliBasic knowledge of front-end technologies, such as HTML, CSS, and JavaScript, so that you can work closely with EA’s front-end development and design teamlicliBasic Knowledge of Machine Learningliul",
	"how_to_apply": "ca href=\"https://www.linkedin.com/jobs/view/2334165591\"https://www.linkedin.com/jobs/view/2334165591ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBazJWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e26dcd3bdc87a8d444428f600e5e4722b40e9cef/LogoEaStacked-20.jpg"
}, {
	"id": "0081e8ff-a2e4-45a1-a433-c8f74407d488",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/0081e8ff-a2e4-45a1-a433-c8f74407d488",
	"created_at": "Tue Jan 12 15:54:14 UTC 2021",
	"company": "Unicon Software Entwicklungs- und Vertriebs GmbH",
	"company_url": "https://www.unicon-software.com",
	"location": "Karlsruhe",
	"title": "Software developer Web Application (m/f/d)",
	"description": "Unicon Software is a pioneer and technology leader in software solutions for thin clients. Since our foundation in 1993, we have been able to continuously expand our technical know-how and product portfolio.pWith the Linux-based eLux® operating system and the associated management software Scout Enterprise Management Suite®, we offer the most powerful software solution for a central IT architecture. More than 1.5 million end devices in over 65 countries worldwide are currently operated and managed with our software. Our largest customer alone uses eLux® on more than 220,000 end devices and thus operates the world's largest centrally managed, heterogeneous thin client installation.pWe have a wide range of customers from various industries that rely on Unicon's technology, such as DATEV, Deutsche Bahn, Sparkassen Finanz Informatik, AOK or Viessmann - all of them benefit from a highly scalable and hardware-agnostic integrated solution portfolio. In addition, we cooperate with several major distribution partners and are OEM partners of Fujitsu, HP and other well-known manufacturers.pCurrently, we are strongly growing and want to expand our team significantly for the optimization of existing as well as the development of new applications. You want to design the web version of our management solution? Then you are exactly right with us.pcstrongTasksstrongpBeing part of the team building our Scout Enterprise Web ApplicationDeveloping the backend with Node.js and MongoDB Working on frontend development with React and ReduxOptimizing the application for high performance, reliability and clusteringRealizing sophisticated applications and services in an agile development environmentWorking on requirements engineering and well as the architecture and design of the corresponding componentsBeing the contact person for technical issues and in charge of the decision-making regarding specific componentspcstrongRequirementsstrongpculcliUniversity degree in computer science, electrical engineering, physics, mathematics or completed training as an IT specialistlicliSeveral years of experience as full stack developer with JavascriptlicliExperience with MongoDB or MS SQL ServerlicliStrong knowledge of Linux and gitlicliAnalytical mind and a great understanding of complex algorithmslicliCuriosity about how things work and eagerness to improve themlicliGood English skills (spoken and written) and good German skillsliulcstrongWhy Unicon?strongpculcliYou’ll have the chance to design an innovative application according to your ideas and thus further develop our solutions, which are used on more than 1.5 million deviceslicliWe see people as the fundamental pillar of our success. Therefore, we invest into the personal growth and skill development of each individuallicliYou will be part of an agile tech company on the path of growthlicliWe are the technological leader in an innovative IT sectorlicliIn the 25+ years of our existence, we have reached an extremely high level of professionalism and technical expertiselicliAt the same time, the atmosphere is still start-up-like and very dynamic, with flat hierarchies and flexible working modelslicliWe encourage the contribution and implementation of own ideas in the sense of extensive personal responsibilitylicliOur teams are characterized by an open communication culture and a strong motivation to performlicliWe offer you an attractive and performance-oriented compensation packageliul",
	"how_to_apply": "ca href=\"https://unicon-software.join.com/jobs/1769815-software-developer-web-application-m-f-d?pid=357a3b4531918760973famp;utm_source=github_jobsamp;utm_medium=paidamp;utm_campaign=single%2Bpostingamp;utm_content=software%2Bdeveloper%2Bweb%2Bapplication%2Bm%2Bf%2Bd\"https://unicon-software.join.com/jobs/1769815-software-developer-web-application-m-f-d?pid=357a3b4531918760973famp;utm_source=github_jobsamp;utm_medium=paidamp;utm_campaign=single%2Bpostingamp;utm_content=software%2Bdeveloper%2Bweb%2Bapplication%2Bm%2Bf%2Bdap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBamlWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b9bb2d086be3549fc8b23d816d726f53500185ff/unicon.jpg"
}, {
	"id": "ca60044c-4a26-4d35-a7a5-c5364bd9e977",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/ca60044c-4a26-4d35-a7a5-c5364bd9e977",
	"created_at": "Tue Jan 12 09:59:55 UTC 2021",
	"company": "Linktree",
	"company_url": "https://jobs.linktr.ee/",
	"location": "Sydney",
	"title": "Full stack engineer",
	"description": "cstrongFull stack engineerstrongpThere are a lot of things we think are great about working at Linktree but we are biased, so here are the answers to the things we get asked most by Engineers when we are hiring at Linktree:pcstrongWhat is your tech stack?strongThe below doesn't mean we expect everyone to have all of the below, our primary languages are react, node.js with some legacy PHP so that is great to have as a starting point.pThe rest of our stack includes React, Node.js, Typescript, Storybook, Elasticsearch, REST APIs, PostgreSQL, GraphQL, AWS (Lambda), Kubernetes, Terraform and Snowflake. Our first build was in PHP so that is in our legacy code but React/Node is where the stack is headed.pcstrongWhat do you look for in engineers?strongGreat problem solvers who enjoy collaborating with others (not just engineers) that value well written and tested code. A match with our current tech stack and the ongoing desire to continue to learn new skills and share yours with others. Experience in similar startup environments can be good as you are used to this style of working but we care more about you and your skills over what names are on your CV.pcstrongWhere is this role based?strongWe are mostly based in Melbourne but currently have engineers in Perth, Tasmania, Newcastle, Queensland, country Victoria, and Ireland. Our CTO ca href=\"https://www.linkedin.com/in/mitchmalone/\"cstrongMitch Malonestronga is also fully remote so you could be anywhere really. We are still all working from home due to COVID but plan on being a mixed remote and on-site company beyond that.pcstrongWhat is your dev environment like?strongLinktree has grown a lot and quite quickly, which means our structures and processes aren't perfect, yet. That should be ok with you and if anything, appeal to you so you can contribute to the design of those systems.We are agile with one of our Lead Engineers also an agile coach and cross-functional. We don't have BA's or have any intention of hiring in the near future, as we expect our Engineers to do requirements analysis and work closely with Product Managers and Designers on developing user stories. Our Engineering team writes unit, integration and e2e tests and we have a DevOps specialist building out DevOps practices.pcstrongWhat is your company culture like?strongLinktree's company culture and values are based around collaboration, diversity, inclusion, and flexibility. Those are all nice words but to give you some more specific examples:pculcliWe are family-friendly and flexible work environment with our team with a number of our team working hours around school and home commitments.licliWe have several diversity and inclusion initiatives underway, including a Damp;I council, training for all staff on neurodiversity and the incorporation of a transgender inclusion policy.licliOur team is diverse across age, gender, and race and we love that.licliDue to COVID we are all remote but even when COVID is behind us, we will be a mixed remote and in-office company. With our team already spread across 8 locations and 3 countries, we will always be some form of remote. licliAll employees have free access to ca href=\"https://www.smilingmind.com.au/\"cstronghttps://www.smilingmind.com.au/stronga amp; ca href=\"https://uprise.co/\"cstronghttps://uprise.co/stronga, including 1:1 coaching sessions from qualified psychologists or counselors.liulWe have grown quickly in 2020, from 20 people to 40 in the past 6 months, and have more growth planned due to the continued expansion of our customer base around the world.pcstrongThe Linktree story…strongpThe Linktree journey begins in 2016, when co-founders Alex, Anthony and Nick were running a digital agency and using Instagram to make announcements about the artists they managed. Created as a side hustle to solve a simple problem, Linktree has well outgrown its roots, with over 9 million users worldwide, 20,000 + new signups every day, and over 120 million unique views per month. Paired with rapid growth, Linktree has recently garnered much attention in the tech world, earning 4th place on Fast Company's ca href=\"https://www.fastcompany.com/90457904/social-media-most-innovative-companies-2020\"cstrong\"10 most innovative social media companies of 2020\"stronga.pThe Linktree audience is broad, spanning publications, artists, celebrities, fashion and beauty influencers, YouTube stars, sports teams and household brands, right the way through to individuals with a side hustle and micro-influencers. Linktree subscribers include Alicia Keys, Selena Gomez, Pharrell, Jamie Oliver, Vice, Red Bull, Adult Swim, Patreon, Naomi Campbell, Comedy Central, Gordon Ramsay, Billabong…and many more!pIf you're still reading this and feel like you're a match for us, please send your details through via the ca href=\"https://ltpx.nl/yRdpuM7\"cstrongapplication formstronga.pcemAgency calls are not appreciated.emcimg src=\"https://camo.githubusercontent.com/9c17178fc40d5bebab71a2963dbea175de93a924/68747470733a2f2f742e6c7470782e6e6c2f747261636b2e7068703f6f7264657269643d323231353930\"p",
	"how_to_apply": "ca href=\"https://ltpx.nl/bKr2AWi\"Klik hier om te solliciterenap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaU9WIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--78795c747dab3d251d285806b22839ded57fbbdb/Linktree%20logo.jpg"
}, {
	"id": "cb287f27-8e08-4677-88e5-4d025a1fee08",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/cb287f27-8e08-4677-88e5-4d025a1fee08",
	"created_at": "Mon Jan 11 21:27:35 UTC 2021",
	"company": "PayPal",
	"company_url": "http:",
	"location": "San Jose, CA",
	"title": "Distinguished Eng.-Platform Unification",
	"description": "Fueled by a fundamental belief that having access to financial services creates opportunity, PayPal (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal’s 305 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies.pThe Commerce Solutions and Services Engineering (CSSE) team is responsible for building solutions and platforms used by all PayPal’s merchants, focusing on the largest customers – the Enterprise, Channel Partners and Marketplaces customer segments. We build applications, services and platforms that allow PayPal customers to accept payments globally across all channels, including the Commerce Platform for Enterprises (ca href=\"https://www.paypal.com/us/business/enterprise\"https://www.paypal.com/us/business/enterprisea), Commerce Platform for Platforms and Marketplaces (ca href=\"https://www.paypal.com/us/business/platforms-and-marketplaces\"https://www.paypal.com/us/business/platforms-and-marketplacesa), Braintree platform (ca href=\"https://www.braintreepayments.com\"https://www.braintreepayments.coma), Hyperwallet platform (ca href=\"https://www.hyperwallet.com\"https://www.hyperwallet.coma), among many other responsibilitiespAs a Distinguished Engineer in our team, you will be leading development to define how large-scale merchants worldwide integrate with the current and next-gen PayPal Commerce Platforms. You will play a critical role integrating complex systems and multiple properties into one seamless, unified platform that leverages multiple engines to provide a powerful payments and payouts experience, including API strategy (GraphQL and REST, webhooks, streaming, SDKs), sandbox and playground environments, simulators, and all other aspects of integration and developer experience. These platforms combined are responsible for processing more than half of PayPal’s transactions worldwide, so this is a high-stakes role – there are very few mission critical APIs like this in the world, with this kind of scale and complexity, and that power so much commerce and so many businesses worldwide. You will play a key and critical role defining how the platform developer experience is shown to the world.pThe ideal candidate will prefer to have no direct reports, being passionate to focus on very hard and deep technical problems, and collaborating with many teams to move big rocks forward. That said, as one of the senior-most individual contributors in the engineering ladder, the candidate will be expected to lead hundreds of others through influence, providing guidance and mentoring as needed, making the whole team better through experience, knowledge and technical talent, making the entire organization more capable of successfully completing larger projects with higher technical complexity.pFinally, the ideal candidate has a proven record of leading efforts to solve large, complex problems. They balance competing technical and product requirements, level up the engineers around them, identify and communicate effectively with all stakeholders, and consider both immediate tactical needs and long-term strategic planning.pResponsibilities:p· Work with Product, Platform and Engineering leaders across the team to identify the most valuable areas of technical contribution, advancing key valuable initiatives, reducing risk on critical projects and advancing our technology stack.p· Drive both technology and product innovation through rapid prototyping and iterative development.p· Provide technical guidance and leadership in design, development, scaling and operation of software applications.p· Be a technical subject matter expert and represent the full internal and external capabilities of our platforms to enable solutions to complex, large-scale customers.p· Mentor, coach, advise and level up engineering talent across the organization.pSkillset and requirements:p· Bachelors degree in Computer Engineering/Computer Science or related field.p· Track record leading, developing, and delivering significant software projects.p· Expertise in designing and troubleshooting large scale distributed systems.p· Proficiency in managing cloud based large-scale infrastructure. Experience with building solutions on the Cloud (ideally GCP and AWS). Experience designing and building systems with Docker containers and Kubernetes.p· Experience in Domain Driven Design and modeling complex business domains.p· Demonstrable experience building complex customer facing platforms, inclusive of complex APIs and other aspects of developer experiences (sandbox, playgrounds, simulators, etc.).p· Demonstrable and in-depth experience with Java stack. Ruby on Rails very desirable.p· Some experience with JavaScript and Node.js is highly desired.p· Experience with Unix/Linux operating systems internals and administration.p· Established experience with monitoring/logging tools and best practices.p· Experience in software release lifecycle with modern distributed version control (e.g. git).p· Experience working in an Agile environment, including Extreme Programming practices like Iterative Development, Continuous Integration (and Deployment) and Test-Driven Development.p· Great analytical and problem-solving skills.p· Strong communicator, both written and spoken.pBehaviors:p· Approach problems with humility, rigor, and decisiveness.p· Demonstrate a high emotional quotient and empathy for your colleagues, creating psychological safety while tackling tough problems and navigating conflicts.p· Identify and solicit input from all stakeholders, balancing competing needs and distilling a coherent strategy.p· Lead by meeting people where they are at and building bridges to where you need them to go.p· Emphasize iterative progress, risk management, and delivering value.p· Leave the campsite cleaner and people stronger.pWe're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.pPayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at ca href=\"mailto:paypalglobaltalentacquisition@paypal.com\"paypalglobaltalentacquisition@paypal.coma.p",
	"how_to_apply": "Please email: ca href=\"mailto:mamunro@paypal.com\"mamunro@paypal.comap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHFWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1bcca8c1ef0e38811264e5d86c556bd4c368cb48/paylog.png"
}, {
	"id": "c05204de-9a30-4b5d-9e53-4db079155253",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/c05204de-9a30-4b5d-9e53-4db079155253",
	"created_at": "Mon Jan 11 03:48:08 UTC 2021",
	"company": "ExpressVPN",
	"company_url": "http://www.expressvpn.com",
	"location": "London / Poznan / Remote",
	"title": "Server-side Software Developer",
	"description": "cstrongLocation: London or Poznan or Remote (within Europe or Asia)strongpcstrongWe're looking for creative server-side software developersstrongpJoin our back-end teams building user-friendly online services for consumers. We use a micro-services architecture with a broad range of different technology stacks and high levels of automated test coverage. The majority of our back-end is written in Ruby.pcstrongHighlightsstrongpculcliScale and performance challenges. Handle tens of thousands of rpm, scale across geographically distributed datacenters, solve complex computational tasks quickly, and be highly available.licliSecurity. We work with world-class penetration testers.licliAPI design. We have client-side apps for Windows, Mac, Android, iOS, Linux, routers, and browser extensions for Chrome, Firefox, and Safari. Keep the API designs simple and meet the various requirements for our apps.licliSplit-testing. We make heavy use of A/B testing to optimize our front-end for sales conversions. We have enough volume to often get significant results within one day.liulcstrongResponsibilitiesstrongpculcliYour responsibilities may cover systems that each bring their own set of interesting technical and design challenges, especially around scale, security, and availability.plicliContinuous Delivery. All logic is tested automatically. We deploy multiple times per day. We often use TDD.plicliMicroservices architecture. We can pick the right stack for each individual application. Currently those involve combinations of Ruby, Go, Node.JS, C, mySQL, Postgres, Redis, MongoDB, RabbitMQ, Docker, Chef and Ansible.plicliCode-reviews. We invest in spreading knowledge around the team, and keeping our code easy to read, test, and maintain.pliulcstrongRequirementsstrongpculcliYou love to solve problems, you’re excited about building well-designed systems, eager to learn and continually improve your skills.licliYou take great pride in the quality of your codelicliExpert in at least one modern server-side language. You test your code primarily with automation.licliEager to learn some Ruby (you’ll see a lot of it here, though it won’t necessarily be your primary language)liulcstrongOptionalstrongpculcliNice to have: Experience building high-load scalable systemslicliNice to have: Devops experience (Linux, Docker, Nginx, Ansible, Kubernetes, Terraform, Cloud-based Databases, Queues)licliIn general, we’re looking for someone with raw smarts and potential who can easily learn the specific skills needed for our work.licliWe’re open to candidates with various levels of experience. From junior to very senior, come talk to us!liulcstrongWhat we offerstrongpculcliChallenging work in a fun and collaborative environmentlicliAttractive compensation and time-off benefitslicliSpacious open-concept and centrally located officeslicliFull-time employment with flexible working hourslicliFully stocked pantry with fresh fruit and snackslicliTeam lunches and company events every quarterlicliMulticultural teams represented by 30+ nationalitiesliulcstrongNote: Please upload your resume as a PDF and do not include any salary or compensation information in it.strongp",
	"how_to_apply": "ca href=\"https://grnh.se/9dea5ab52us\"Apply Hereap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0NWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--25d3d1c869a42925cd041c9f6188aea859b6631c/affiliate-assets_-logo-expressvpn-red-square-stacked.png"
}, {
	"id": "46ab84b4-12dc-4a95-ab08-422428554dfc",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/46ab84b4-12dc-4a95-ab08-422428554dfc",
	"created_at": "Fri Oct 09 19:42:30 UTC 2020",
	"company": "Playco",
	"company_url": "http://www.play.co",
	"location": "Remote",
	"title": "Core/Backend Engineer",
	"description": "Here at Playco, we make games that bring the world closer together through play.pOur ideal teammates are thoughtful, humble, and passionate professionals who can both zoom into the details and zoom out to embrace the big picture. We are inspired by makers and tinkerers, who are unafraid to experiment with a healthy disregard for constraints. We hope you'll enrich our team with your enthusiasm and passion, both for games and for life.pOur engineers are generally amazing at something and great at everything else. We write scalable backend systems, cross-compilers, JavaScript / TypeScript game APIs and tools, and whatever else it takes. No matter what you work on each day, you will work with the best engineers in the world; we have top talent in every part of our stack.pcstrongThe RolestrongpculcliBe a key member of a high performing software engineering team.licliArchitect and code sophisticated client/server systems for instant gaming.licliPlay a critical role in day-to-day coding, performance profiling, optimization, and general troubleshooting.licliCollaborate with design, engineering, and production teams to devise optimal engineering solutions to game requirements.licliLearn from and mentor other engineers on your team.licliTake ownership of your projects to make them the best they can possibly be.licliProvide valuable input on the company’s long-term engineering roadmap and help identify areas of opportunity for improvement.liulcstrongDesired SkillsstrongpculcliBachelor’s degree in Computer Science or related field, or equivalent experience.licli3+ years of professional software engineering experience.licliExperience writing clean, testable, high-quality code and designing highly scalable systems in production.licliSolid familiarity with deployment on cloud environments (AWS, GCP, Azure, etc.).licliStrong Computer Science fundamentals in software systems design, algorithms, and data structures.licliAbility to interact with peers in a constructive and productive style.licliFamiliarity with git, svn, or other VCS.licliGood communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers, and other developers.licliStrong team player with a positive attitude.liulcstrongBonusstrongpculcliExpert knowledge of NodeJS and ES6 / TypeScript.licliDevOps experience -- setting up CI/CD environments, orchestrating deployments, creating monitoring dashboards, anything that makes the development process easier, more enjoyable and more accountable.licliExperience in game development and shipped titles.liul",
	"how_to_apply": "ca href=\"https://jobs.lever.co/playco/4cbca38a-563f-432f-978b-b41f1dabc66c?lever-origin=appliedamp;lever-source%5B%5D=GitHub\"Apply Hereap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2FMIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cb29d1ab0fec648aee52b0ad6e7ec0a0485551ca/Round_Logo1%20(1).png"
}, {
	"id": "aa02f7d8-f353-4885-a51d-073613afbc42",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/aa02f7d8-f353-4885-a51d-073613afbc42",
	"created_at": "Sat Jan 09 21:25:42 UTC 2021",
	"company": "PAI Health",
	"company_url": "https://www.paihealth.com",
	"location": "Vancouver, British Columbia",
	"title": "Senior Full Stack Engineer",
	"description": "cstrongPAI Health has joined forces with Huami Corporation and is scaling up internationally. Help us lead this growth as a Senior Full Stack Engineer!strongpcstrongAbout PAI HealthstrongpOur mission is to become the global health standard for physical activity by delivering personalized digital solutions to promote, inspire and instill active lifestyle habits that lead to improved health outcomes and quality of life. Creative and collaborative working practices are at the core of PAI Health. We aren’t looking for just another spoke in the wheel; this is your opportunity to make a big global impact with your work in an entrepreneurial environment!pWe care deeply about the growth of our staff, ensuring each member is empowered with the necessary resources and support to not only succeed but flourish in their roles and career. At PAI Health, we are constantly striving to be at the forefront of positive social change and have crafted an inclusive and diverse company culture, which welcomes all to come and thrive here.pcstrongWhat’s Next for PAI Health?strongpOur science-backed IP and metrics, as well as engaging user experience, has attracted the interest of leading brands including Prudential Asia and Huami Corporation, one of the world’s largest smart wearable technology companies. With Huami’s proven AI algorithms, massive data sets and analytical capabilities, global distribution channels, and demonstrated success launching international products in the health tech space, this acquisition has put PAI Health on a whole new playing field.pLooking ahead, we have a unique opportunity to scale up our product at an international level, backed by the expertise and power of a global organization.pcstrongWhat Can You Expect?strongpAs Senior Full Stack Engineer, you will be a technical leader at PAI Health, overseeing code, setting the standard for quality and acting as a trusted advisor to both leadership and your team. You will work closely with our engineering, product management and product design teams to help translate business requirements into delivered platform features.pYou can expect your day-to-day to include:pcstrongCoding (80%)strongpcolcliDrive continuous delivery by participating in our agile development process, including estimating effort and complexity of new features and tasks.licliProduce clean, performant code, establishing quality standards with the engineering team through example and leadership.licliDesign systems architecture, including infrastructure that enables continuous integration and delivery.licliContribute fresh ideas and concepts by actively seeking out new technologies and best practices.liolcstrongMentorship (20%)strongpcolcliLead projects, gathering requirements, setting timelines, communicating milestones, and proactively troubleshooting.licliMentor and lead junior engineers, performing code reviews and delivering meaningful feedback.licliDeliver projects successfully by collaborating with project managers, product management and other key stakeholders.liolcstrongYour Backgroundstrongpculcli5+ years of full stack development experience with relevant post-secondary educationlicliExperience (and interest in) leading teams or projectslicliTeam player – you include your team in the process, you’re not looking to walk alonelicliMentorship – you lead by example and give and take constructive feedbacklicliCommunication – you can express your ideas concisely and effectivelylicliCommitment – you’re never afraid to suggest alternatives, but always commit to the collective decisionlicliHands-on contributor – you enjoy writing code, solving problems, and being in the trencheslicliProcess-oriented – you identify as process-orientedlicliConfident – you manage stakeholder expectations and know when to say ‘no’liulcstrongYour Tech StackstrongpculcliModern full-stack frameworks (NodeJS is ideal)licliModern front-end languages amp; frameworks (React is ideal)licliStrong understanding of AWS and cloud native application development (microservices architecture)licliExperience with DockerliulcstrongNot Convinced Yet?strongpIn addition to being part of a great company with a proven product, you’ll get to work on new and interesting technical challenges every day. You will be a trusted leader as we scale up. You will be empowered to succeed in your role with the resources and technology of an established global market leader. We also offer:pculcliCompetitive compensation with extended benefits to look after the ones you lovelicliFlexible schedule with a commitment to work-life balance – put your family first, for reallicliOpportunity to be a valued leader and work closely with our leadership teamlicliOngoing training and development opportunities to propel your careerlicliLeading, modern technology and tools to build and experiment withlicliInclusive and collaborative culture built on communication and respectlicliFun remote (and in-person when possible) social events to spend time with your teammates – we’ve done things like virtual escape rooms, music and wellness sessions, trivia nights, and fitness related challenges.licliAtmosphere that encourages an active lifestyle, that suits you. We provide wearable devices to all staff and give away rewards throughout the year.licliTeam that encourages connection and collaboration through friendly competitions, weekly kudos’, etc. When COVID-19 allows it, we also have a great physical workspace that includes foosball, ping pong, beer on tap, gym, rooftop patio, and more!liulcstrongInterested in learning more? Apply today with your resume and cover letter!strongpcemPAI Health is an Equal Opportunity employer and welcomes everyone to our team. If you need reasonable accommodation at any point in the application or interview process, please let us know. In your application, please feel free to note which pronouns you use (for example: she/her/hers, he/him/his, they/them/theirs, etc).emp",
	"how_to_apply": "Apply on our career site!pca href=\"https://paihealth.bamboohr.com/jobs/view.php?id=122\"https://paihealth.bamboohr.com/jobs/view.php?id=122ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdm1VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b7ca6a65f7d4184edb73ff81352f5c09395cba99/PAI%20Logo.png"
}, {
	"id": "65f747a3-4a1f-47b3-8caf-1d92f6d0a39e",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/65f747a3-4a1f-47b3-8caf-1d92f6d0a39e",
	"created_at": "Sat Jan 09 03:23:58 UTC 2021",
	"company": "PAI Health",
	"company_url": "https://www.paihealth.com",
	"location": "Vancouver, British Columbia",
	"title": "Software Development Team Lead",
	"description": "cstrongPAI Health is hiring a Software Development Team Lead with a passion for healthy living to help revolutionize global wellness!strongpcstrongAbout PAI HealthstrongpOur mission is to become the global health standard for physical activity by delivering personalized digital solutions to promote, inspire and instill active lifestyle habits that lead to improved health outcomes and quality of life. Creative and collaborative working practices are at the core of PAI Health. We aren’t looking for just another spoke in the wheel; this is your opportunity to make a big global impact with your work in an entrepreneurial environment!pWe care deeply about the growth of our staff, ensuring each member is empowered with the necessary resources and support to not only succeed but flourish in their roles and career. At PAI Health, we are constantly striving to be at the forefront of positive social change and have crafted an inclusive and diverse company culture, which welcomes all to come and thrive here.pcstrongWhat’s Next for PAI Health?strongpOur science-backed IP and metrics, as well as engaging user experience, has attracted the interest of leading brands including Prudential Asia and Huami Corporation, one of the world’s largest smart wearable technology companies. With Huami’s proven AI algorithms, massive data sets and analytical capabilities, global distribution channels, and demonstrated success launching international products in the health tech space, this acquisition has put PAI Health on a whole new playing field.pLooking ahead, we have a unique opportunity to scale up our product at an international level, backed by the expertise and power of a global organization.pcstrongWhat to ExpectstrongpAs a Team Lead at PAI Health, you will be a trusted advisor to both leadership and your team. You will work cross-departmentally to help translate business requirements into delivered platform features, providing feedback and expertise along the way.pYour daily responsibilities include:pcolcliPlanning – Lead our agile development process, gather project requirements, set timelines, communicate milestones, collaborate with key stakeholders and proactively troubleshoot.licliExecution – Produce clean, performant code and contribute to the design of systems architecture and CI/CD infrastructure.licliCoaching – Lead and mentor junior engineers, establish quality standards, perform code reviews and delivering meaningful feedback to help the team grow.licliEngagement – Motivate team members, lead by example and ensure alignment to company and department objectives, metrics and values.licliContribution – Advise on fresh ideas and concepts by actively seeking out new technologies and best practices.liolcstrongWho You ArestrongpculcliExperienced – 5+ years of full stack development experience with relevant post-secondary education and experience leading projects or teamslicliTeam player – you include your team in the process, you’re not looking to walk alonelicliMentorship – you lead by example and give and take constructive feedbacklicliCommunication – you can express your ideas concisely and effectivelylicliCommitment – you encourage ideation and suggestions, but can evoke a collective decision when it matterslicliHands-on contributor – you enjoy writing code, solving problems, and being in the trencheslicliProcess-oriented – you see things logically and enjoy optimizing processlicliConfident – you manage stakeholder expectations and know when to say ‘no’liulcstrongYour Tech StackstrongpculcliModern full-stack frameworks (NodeJS is ideal)licliModern front-end languages amp; frameworks (React is ideal)licliStrong understanding of AWS and cloud native application development (microservices architecture)licliExperience with DockerliulcstrongNot Convinced Yet?strongpIn addition to being part of a great company with a proven product, you’ll lead work on new and interesting technical challenges every day. You will be a trusted leader as we scale up. You will be empowered to succeed in your role with the resources and technology of an established global market leader. We also offer:pculcliCompetitive compensation with extended benefits to look after the ones you lovelicliFlexible schedule with a commitment to work-life balance – put your family first, for reallicliOpportunity to be a valued leader and work closely with our leadership teamlicliOngoing training and development opportunities to propel your careerlicliLeading, modern technology and tools to build and experiment withlicliInclusive and collaborative culture built on communication and respectlicliFun remote (and in-person when possible) social events to spend time with your teammates – we’ve done things like virtual escape rooms, music and wellness sessions, trivia nights, and fitness related challenges.licliAtmosphere that encourages an active lifestyle, that suits you. We provide wearable devices to all staff and give away rewards throughout the year.licliTeam that encourages connection and collaboration through friendly competitions, weekly kudos’, etc. When COVID-19 allows it, we also have a great physical workspace that includes foosball, ping pong, beer on tap, gym, rooftop patio, and more!liulcstrongExcited to learn more? Apply today with your resume and cover letter!strongpcemPAI Health is an Equal Opportunity employer and welcomes everyone to our team. If you need reasonable accommodation at any point in the application or interview process, please let us know. In your application, please feel free to note which pronouns you use (for example: she/her/hers, he/him/his, they/them/theirs, etc).emp",
	"how_to_apply": "Apply directly through our career page!pca href=\"https://paihealth.bamboohr.com/jobs/view.php?id=124\"https://paihealth.bamboohr.com/jobs/view.php?id=124ap",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdk9VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--610dedda3ec8002b2b35934b4f2d7c6d45460449/PAI%20Logo.png"
}]